{
  "backend/main.mo": "Defines the core challenge actor with storage, authorization, invite-link state, challenge records, chat messages, assignment canonicalization, and build metadata queries.",
  "feature_evidence.json": "Lists implemented features with associated source files, components, test IDs, and confidence levels for tracking development evidence.",
  "frontend-file-summaries.txt": "Provides one‑sentence summaries of all frontend source files to aid in build planning and navigation.",
  "frontend/index.css": "Forwarding stylesheet that re-exports the main theme and global styles from src/index.css.",
  "frontend/index.html": "HTML entry point defining meta tags, cache-busting headers, and loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main application logic managing authentication, challenge state, URL-sync navigation, update checks, and gated routing between screens.",
  "frontend/src/components/AppShell.tsx": "UI shell that provides a centered mobile layout and suppresses the migration banner.",
  "frontend/src/components/AppUpdatingNotice.tsx": "Displays a blocking notice when the app detects a version mismatch and triggers an update.",
  "frontend/src/components/AssignmentDetailText.tsx": "Renders assignment text with bolded step headers while preserving spacing and formatting.",
  "frontend/src/components/AudioRecorder.tsx": "Audio recording UI handling capture, playback, confirmation dialog, and single-trigger upload flow with error and progress states.",
  "frontend/src/components/AuthButton.tsx": "Authentication button handling II login/logout with loading states and cache clearing.",
  "frontend/src/components/AuthIconButton.tsx": "Icon-only auth button toggling II login/logout with loading indicators and cache clearing.",
  "frontend/src/components/AutoInvitationRedeemGate.tsx": "Auto-detects and redeems stored invitation codes, showing loading/error UI and refreshing challenge-related queries.",
  "frontend/src/components/ChallengeChatTab.tsx": "Challenge chat interface supporting sending, editing, replying, scrolling, and participant name resolution.",
  "frontend/src/components/ChallengeDeletedNotice.tsx": "Dismissible popup showing translated message sections when a challenge has been deleted.",
  "frontend/src/components/ChatReplyReference.tsx": "Displays referenced chat message preview with sender name lookup from cache or individual fetch.",
  "frontend/src/components/DevPanel.tsx": "Developer panel showing auth info with controls for login and query refresh.",
  "frontend/src/components/InfoPopups.tsx": "Renders two info popups using SharedPopup with translated sections for extra explanations.",
  "frontend/src/components/LanguageSwitcher.tsx": "Empty placeholder file for a language-switching component.",
  "frontend/src/components/PopupBodySections.tsx": "Renders heading/content sections for popup bodies with simple formatting.",
  "frontend/src/components/ProfileCompletionGate.tsx": "Gate requiring users to complete their profile name before accessing the app, with form and loading states.",
  "frontend/src/components/QueryStateGate.tsx": "Wraps a React Query result and displays loading or error UI before rendering children with data.",
  "frontend/src/components/RecordingFeedback.tsx": "Empty file with no implementation.",
  "frontend/src/components/RecordingLevelMeter.tsx": "Displays a visual audio level meter with color-coded bar based on normalized input level.",
  "frontend/src/components/RecordingPlayer.tsx": "Audio player component handling play/pause, seeking, timing, and cleanup for a given audio URL.",
  "frontend/src/components/RecordingWaveform.tsx": "Empty file with no implementation.",
  "frontend/src/components/SharedPopup.tsx": "Wrapper around shadcn dialog components providing consistent popup layout and scroll behavior.",
  "frontend/src/components/ThemeToggle.tsx": "Button that toggles app theme between light and dark using useTheme.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useAppUpdateGuard.ts": "Checks app version on startup and triggers a one‑time forced refresh when outdated.",
  "frontend/src/hooks/useAudioRecording.ts": "Manages microphone recording, audio analysis, timers, and cleanup while exposing recording state and controls.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Returns authentication status and principal based on Internet Identity context.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, identity loading, and AuthClient management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor methods for user profiles, recordings, chat, and challenge data.",
  "frontend/src/hooks/useSuppressMigrationBanner.ts": "Hook that scans DOM and hides elements containing a specific migration message using a MutationObserver.",
  "frontend/src/hooks/useTheme.ts": "Hook managing light/dark theme selection with localStorage persistence and DOM class toggling.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Query hook fetching the authenticated user's challenge status from the actor service.",
  "frontend/src/i18n/i18n.ts": "Empty placeholder file for i18n setup.",
  "frontend/src/i18n/I18nContext.tsx": "Provides a translation context using English translations and helper for nested key lookup.",
  "frontend/src/i18n/index.ts": "Empty index file for i18n exports.",
  "frontend/src/i18n/locales/en.json": "Empty English locale JSON file.",
  "frontend/src/i18n/locales/es.json": "Empty Spanish locale JSON file.",
  "frontend/src/i18n/translations.ts": "Defines the English translation dictionary for app UI text across multiple screens.",
  "frontend/src/index.css": "Tailwind CSS base/theme definitions including light/dark variables and global styling.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, Internet Identity, and global styles.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Empty placeholder component for Screen 1.",
  "frontend/src/screens/Screen3Placeholder.tsx": "Placeholder UI for users without an active challenge, offering refresh and navigation options.",
  "frontend/src/screens/Screen4Placeholder.tsx": "Large placeholder for challenge creation and management logic with multiple queries and actions.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Empty placeholder file for Screen 5 challenge management.",
  "frontend/src/screens/Screen5Placeholder.tsx": "Placeholder showing Screen 5 state info and an optional edit navigation button.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Complex challenge screen handling tabs, participant/day selection, audio recording upload/playback, and recovery on challenge-not-found errors.",
  "frontend/src/screens/UnifiedEntryMenu.tsx": "Entry menu deciding whether to log in, create, or enter a challenge based on auth and challenge status.",
  "frontend/src/utils/appUrlState.ts": "Utility to read, write, and clear screen and navigation state from URL search parameters.",
  "frontend/src/utils/appVersion.ts": "Functions to read and parse the app version from meta tags or fetched HTML, validating placeholders.",
  "frontend/src/utils/assignments.ts": "Defines the fixed set of 5 daily assignments with canonical IDs and detailed content for all challenge days.",
  "frontend/src/utils/backendBuildInfo.ts": "Caches backend build info and exposes helpers to read, identify, and clear the stored build metadata.",
  "frontend/src/utils/challengeContext.ts": "Persists and retrieves the active challenge ID in sessionStorage for context recovery.",
  "frontend/src/utils/challengeDayFormat.ts": "Formats challenge day headers by computing weekday and date from start time and day index.",
  "frontend/src/utils/challengeDeletedNotice.ts": "SessionStorage helpers to set, check, and clear a flag indicating a deleted challenge.",
  "frontend/src/utils/challengeRecovery.ts": "Resets all client challenge state, clearing storage, URL parameters, and invalidating related React Query caches.",
  "frontend/src/utils/hardRefresh.ts": "Implements a cache-busted hard refresh with loop protection and a helper to clear the protection flag.",
  "frontend/src/utils/invitationCodes.ts": "Generates random uppercase invitation codes using a restricted alphanumeric charset.",
  "frontend/src/utils/invitationLinks.ts": "Builds, parses, clears, and persists invitation link parameters using URL and sessionStorage utilities.",
  "frontend/src/utils/recordingDayIndex.ts": "Converts and validates recording day values between UI (1-7) and backend (0-6) formats.",
  "frontend/src/utils/recordingDiagnostics.ts": "Provides safe diagnostic logging for recording upload attempts, failures, and successes with version info.",
  "frontend/src/utils/recordingIds.ts": "Defines and validates canonical recording assignment IDs and normalizes UI day values for backend use.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Extracts, identifies, and maps backend errors to user-friendly sanitized messages.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters across normal and hash-based routing.",
  "frontend/src/utils/versionCheck.ts": "Fetches the latest app version to detect mismatches and indicate whether a refresh is needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH-based color tokens, container settings, extended animations, and typography/container-queries/animate plugins.",
  "project_state.json": "Defines the project’s rebuild plan for a reliable end‑to‑end audio flow, including constraints, architectural notes, known issues, and existing feature requirements."
}