{
  "backend/main.mo": "Defines challenge, recording, chat, and user profile types, initializes access control and storage, and maintains maps for challenges, participants, and assignments.",
  "feature_evidence.json": "Lists feature evidence records linking features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend source files for reference.",
  "frontend/index.css": "Thin import wrapper forwarding to the main stylesheet under src/index.css.",
  "frontend/index.html": "HTML entry file setting meta tags, cache‑busting headers, and loading the main React bundle.",
  "frontend/src/App.tsx": "Main application logic handling auth flow, screen routing, URL state sync, update checks, and challenge deletion notices.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing centered mobile container and suppressing the migration banner.",
  "frontend/src/components/AppUpdatingNotice.tsx": "Fullscreen notice shown during version‑mismatch auto‑refresh with loading indicator.",
  "frontend/src/components/AssignmentDetailText.tsx": "Renders assignment text with bolded step headings while preserving line breaks.",
  "frontend/src/components/AudioRecorder.tsx": "Audio recording UI handling record, review, save, delete, share confirmation, upload state, and error messaging.",
  "frontend/src/components/AuthButton.tsx": "Authentication button managing II login/logout states with translated labels and query cache clearing.",
  "frontend/src/components/AuthIconButton.tsx": "Icon-only login/logout button handling Internet Identity auth and cache clearing.",
  "frontend/src/components/AutoInvitationRedeemGate.tsx": "Automatically redeems stored invitation codes and displays loading or error states before rendering children.",
  "frontend/src/components/ChallengeChatTab.tsx": "Challenge chat UI with message sending, editing, replying, and auto-scrolling tied to active challenge state.",
  "frontend/src/components/ChallengeDeletedNotice.tsx": "Popup dialog notifying users a challenge was deleted with scrollable content and dismiss action.",
  "frontend/src/components/ChatReplyReference.tsx": "Shows a referenced message preview in replies, resolving sender names from cached or fetched data.",
  "frontend/src/components/DevPanel.tsx": "Optional developer panel showing auth info and providing state refresh tools.",
  "frontend/src/components/InfoPopups.tsx": "Renders buttons that open informational popups with translated sectioned content.",
  "frontend/src/components/LanguageSwitcher.tsx": "Empty placeholder component.",
  "frontend/src/components/PopupBodySections.tsx": "Renders popup sections with headings and text, preserving formatting and spacing.",
  "frontend/src/components/ProfileCompletionGate.tsx": "Blocks app until user completes profile name, providing a form and handling profile mutations.",
  "frontend/src/components/QueryStateGate.tsx": "Wrapper component that handles loading, error, and success states for a query before rendering children.",
  "frontend/src/components/RecordingFeedback.tsx": "Empty placeholder component.",
  "frontend/src/components/RecordingLevelMeter.tsx": "Displays a color-coded audio level bar based on a normalized input value.",
  "frontend/src/components/RecordingPlayer.tsx": "Audio player component with play/pause, seek slider, and time display using an HTMLAudioElement.",
  "frontend/src/components/RecordingWaveform.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/SharedPopup.tsx": "Wrapper around shadcn Dialog providing consistent popup layout, scrolling, and trigger handling.",
  "frontend/src/components/ThemeToggle.tsx": "Button that switches between light and dark themes using the useTheme hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAppUpdateGuard.ts": "Checks app version on startup and triggers a one-time hard refresh if outdated, with loop protection.",
  "frontend/src/hooks/useAudioRecording.ts": "Hook for recording microphone audio with live level analysis, managing blobs, timers, and cleanup.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Returns authentication status and principal string based on Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query wrappers for backend calls, standardized query keys, and assignment ID retry logic.",
  "frontend/src/hooks/useSuppressMigrationBanner.ts": "React hook that scans and observes DOM mutations to hide unwanted migration banners by matching text content.",
  "frontend/src/hooks/useTheme.ts": "Hook that manages light/dark theme based on localStorage or system preference and toggles the document class.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Fetches the user's challenge status using React Query when authenticated and an actor is available.",
  "frontend/src/i18n/i18n.ts": "Empty placeholder file for i18n setup.",
  "frontend/src/i18n/I18nContext.tsx": "Provides a translation context using English strings and a nested key lookup helper.",
  "frontend/src/i18n/index.ts": "Empty index file for i18n exports.",
  "frontend/src/i18n/locales/en.json": "Empty English locale file.",
  "frontend/src/i18n/locales/es.json": "Empty Spanish locale file.",
  "frontend/src/i18n/translations.ts": "Defines the English translation dictionary for multiple app screens and UI strings.",
  "frontend/src/index.css": "Tailwind-based global styles defining CSS variables, dark mode values, and base styling.",
  "frontend/src/main.tsx": "App entry point that initializes React Query, Internet Identity, global styles, and mounts the app.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Empty placeholder component for Screen 1.",
  "frontend/src/screens/Screen3Placeholder.tsx": "UI placeholder for the no-active-challenge screen with state refresh, navigation, and translated text.",
  "frontend/src/screens/Screen4Placeholder.tsx": "Large placeholder for creating or managing a challenge, including dates, codes, participants, and mutations.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Empty placeholder for managing a challenge.",
  "frontend/src/screens/Screen5Placeholder.tsx": "Placeholder for an active challenge screen showing status, actions, and translation-based text.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Main challenge screen handling day selection, participant views, audio recording upload/share/delete, and challenge state recovery. Integrates multiple queries, URL state, and UI components for the 7‑day challenge flow.",
  "frontend/src/screens/UnifiedEntryMenu.tsx": "Entry menu deciding whether to log in, resume a challenge, or create one based on auth and user status. Renders hero layout, CTA button, and settings/auth controls.",
  "frontend/src/utils/appUrlState.ts": "Reads, writes, and clears screen/tab/day state in URL search params without affecting other parameters. Provides lightweight navigation state persistence.",
  "frontend/src/utils/appVersion.ts": "Gets the running app version from a meta tag and extracts versions from fetched HTML, filtering out placeholders. Used for deploy/version comparison.",
  "frontend/src/utils/assignmentIdCompat.ts": "Provides mapping and normalization between hyphenated and underscored assignment IDs with error parsing for invalid‑assignment backend responses. Supports compatibility retry logic.",
  "frontend/src/utils/assignments.ts": "Defines the fixed 5 daily assignments for the 7‑day challenge with canonical IDs and detailed text content. Ensures alignment with backend assignment identifiers.",
  "frontend/src/utils/backendBuildInfo.ts": "Caches backend build info in-memory and exposes getters, a short identifier generator, and a clear function. Helps diagnose frontend/backend mismatches.",
  "frontend/src/utils/challengeContext.ts": "Stores and retrieves the active challenge ID in sessionStorage for restoring context after refresh. Includes helpers to persist, get, and clear the ID.",
  "frontend/src/utils/challengeDayFormat.ts": "Formats challenge day headers using the start timestamp to compute weekday and date. Falls back gracefully when startTime is missing.",
  "frontend/src/utils/challengeDeletedNotice.ts": "Persists a flag in sessionStorage indicating that a challenge was deleted and exposes helpers to set, read, and clear it.",
  "frontend/src/utils/challengeRecovery.ts": "Provides a full reset of all challenge-related client state by clearing stored IDs, URL state, and invalidating/removing React Query caches.",
  "frontend/src/utils/hardRefresh.ts": "Implements a cache‑busted hard refresh with loop protection and a helper to clear the protection flag.",
  "frontend/src/utils/invitationCodes.ts": "Generates random uppercase alphanumeric invitation codes using a restricted character set.",
  "frontend/src/utils/invitationLinks.ts": "Builds, parses, clears, and persists invitation link parameters while preserving navigation state.",
  "frontend/src/utils/recordingDayIndex.ts": "Converts between UI (1–7) and backend (0–6) day values with validation helpers.",
  "frontend/src/utils/recordingDiagnostics.ts": "Logs recording upload attempts, failures, and successes with minimal sanitized context and version info.",
  "frontend/src/utils/recordingIds.ts": "Normalizes recording day and assignment IDs, validates canonical assignment IDs, and provides related utilities.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Extracts and sanitizes error messages, mapping backend errors to safe, user‑friendly messages and providing error‑type checks.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL and session parameters, supporting both query and hash‑based routing.",
  "frontend/src/utils/versionCheck.ts": "Implements version checking by comparing the running app version with a freshly fetched HTML version and returns structured results; includes a deprecated wrapper for legacy refresh checks.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, including issues, feature requirements, and a pending fix request related to audio recording upload and share failures due to disallowed origin."
}