{
  "backend/main.mo": "Actor defining challenge, chat, recording, and user-profile logic with authorization and blob storage mixins.",
  "feature_evidence.json": "Report linking a cache‑busting rebuild feature to specific frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Collection of autogenerated 1–2 sentence summaries for many frontend files describing their roles.",
  "frontend/.gitignore": "Ignore rules for node modules, build outputs, env files, IDE files, logs, and caches.",
  "frontend/index.css": "Thin wrapper that re‑imports the main stylesheet from src/index.css.",
  "frontend/index.html": "HTML entry page with cache‑busting meta tags and placeholder for injected build version.",
  "frontend/scripts/generateAppVersion.mjs": "Build script generating a unique version string, writing it to .env.local and a generated TS module.",
  "frontend/src/App.tsx": "Main app component coordinating authentication, challenge status, navigation, URL sync, and version stamping.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing centered mobile container and invoking migration-banner suppression.",
  "frontend/src/components/AppUpdatingNotice.tsx": "Overlay notice shown during forced refresh when a version mismatch is detected.",
  "frontend/src/components/AssignmentDetailText.tsx": "Component that renders multiline assignment text and bolds lines starting with step labels.",
  "frontend/src/components/AudioRecorder.tsx": "Audio recording UI handling capture, playback, sharing, deletion, and upload state management.",
  "frontend/src/components/AuthButton.tsx": "Login/logout button using Internet Identity with loading states and cache clearing.",
  "frontend/src/components/AuthIconButton.tsx": "Icon-only authentication button handling Internet Identity login/logout with cache resets.",
  "frontend/src/components/AutoInvitationRedeemGate.tsx": "Automatically redeems persisted invitation codes and shows loading/error UI while updating related queries.",
  "frontend/src/components/ChallengeChatTab.tsx": "Chat interface for a challenge with message fetch, send, edit, reply, and auto-scroll behavior.",
  "frontend/src/components/ChallengeDeletedNotice.tsx": "Popup dialog showing that a challenge was deleted with scrollable informational sections.",
  "frontend/src/components/ChatReplyReference.tsx": "Displays a referenced chat message preview by fetching or finding it and resolving the sender name.",
  "frontend/src/components/DevPanel.tsx": "Optional developer panel showing auth info and offering state refresh tools.",
  "frontend/src/components/InfoPopups.tsx": "Renders trigger buttons and shared popups for informational sections like social contemplation and challenge details.",
  "frontend/src/components/LanguageSwitcher.tsx": "Empty placeholder component file.",
  "frontend/src/components/PopupBodySections.tsx": "Renders sections with headings and text for popup bodies.",
  "frontend/src/components/ProfileCompletionGate.tsx": "Gate that requires users to complete their profile name before accessing the app content.",
  "frontend/src/components/QueryStateGate.tsx": "Wrapper component that handles loading, error, and success states for React Query results and renders children with fetched data.",
  "frontend/src/components/RecordingFeedback.tsx": "Empty file with no implementation.",
  "frontend/src/components/RecordingLevelMeter.tsx": "Displays a colored audio level meter based on normalized input level with percentage output.",
  "frontend/src/components/RecordingPlayer.tsx": "Audio player component that loads an audio URL, supports play/pause, seeking, and shows time progress.",
  "frontend/src/components/RecordingWaveform.tsx": "Empty file with no implementation.",
  "frontend/src/components/SharedPopup.tsx": "Reusable dialog wrapper providing consistent layout, scrolling, and trigger behavior using shadcn UI components.",
  "frontend/src/components/ThemeToggle.tsx": "Theme toggle button that switches between light and dark modes using a custom hook.",
  "frontend/src/generated/appVersion.ts": "Build‑generated file exposing a placeholder constant for the application version.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAppUpdateGuard.ts": "Startup hook that checks app version mismatches and triggers a one‑time forced refresh with loop prevention.",
  "frontend/src/hooks/useAudioRecording.ts": "Hook that manages audio recording, microphone access, level analysis, timers, and cleanup for recording sessions.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Hook that derives authentication status and principal string from Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for handling Internet Identity login, stored identities, and related state and actions.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks and key constants for fetching and mutating user profiles, challenge data, recordings, and chat messages via an actor API.",
  "frontend/src/hooks/useSuppressMigrationBanner.ts": "Defines a hook that hides unwanted migration banners by scanning DOM nodes and using a MutationObserver.",
  "frontend/src/hooks/useTheme.ts": "Implements a light/dark theme hook with localStorage persistence and system‑preference fallback.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Fetches the user's challenge status using React Query when authenticated and an actor is available.",
  "frontend/src/i18n/i18n.ts": "Empty file placeholder for i18n setup.",
  "frontend/src/i18n/I18nContext.tsx": "Sets up a simple i18n context that provides English translations and enforces English/LTR document settings.",
  "frontend/src/i18n/index.ts": "Empty index file for i18n exports.",
  "frontend/src/i18n/locales/en.json": "Empty placeholder for English locale JSON.",
  "frontend/src/i18n/locales/es.json": "Empty placeholder for Spanish locale JSON.",
  "frontend/src/i18n/translations.ts": "Contains the English translation dictionary for the app with structured keys for UI text.",
  "frontend/src/index.css": "Global Tailwind CSS configuration defining design tokens, dark mode variables, and base/component styles.",
  "frontend/src/main.tsx": "Renders the app root with React Query and Internet Identity providers applied.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Empty placeholder component for Screen 1.",
  "frontend/src/screens/Screen3Placeholder.tsx": "Displays a placeholder UI for users with no active challenge, offering actions, recovery options, and translated text.",
  "frontend/src/screens/Screen4Placeholder.tsx": "Large placeholder screen for challenge creation and management, handling invitation codes, participants, start time, and various challenge mutations.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Empty file placeholder for the challenge management screen.",
  "frontend/src/screens/Screen5Placeholder.tsx": "UI placeholder showing challenge state info with an optional edit button and info popups.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Main in-challenge screen managing recordings, tabs, participant data, and URL state for daily assignments.",
  "frontend/src/screens/UnifiedEntryMenu.tsx": "Unified entry screen determining navigation based on auth and challenge status with login and action buttons.",
  "frontend/src/utils/appUrlState.ts": "Utility for reading, writing, and clearing app navigation state via URL query parameters.",
  "frontend/src/utils/appVersion.ts": "Provides functions to read, validate, extract, and stamp the running app version from HTML meta tags.",
  "frontend/src/utils/assignments.ts": "Defines the fixed daily assignment set for the challenge with IDs, titles, and instructional content.",
  "frontend/src/utils/backendBuildInfo.ts": "Caches backend build info client-side and provides accessors plus a derived build identifier.",
  "frontend/src/utils/challengeContext.ts": "Stores, retrieves, and clears the active challenge ID in sessionStorage.",
  "frontend/src/utils/challengeDayFormat.ts": "Formats challenge day headers using start time and day index to produce readable dates.",
  "frontend/src/utils/challengeDeletedNotice.ts": "Persists and manages a sessionStorage flag indicating a deleted-challenge notice.",
  "frontend/src/utils/challengeRecovery.ts": "Clears all client-side challenge state and invalidates related React Query caches.",
  "frontend/src/utils/hardRefresh.ts": "Performs cache‑busted hard refreshes with loop protection and utilities to try or clear refresh state.",
  "frontend/src/utils/invitationCodes.ts": "Generates random uppercase alphanumeric invitation codes without ambiguous characters.",
  "frontend/src/utils/invitationLinks.ts": "Builds, parses, persists, and clears challenge invitation URL parameters and sessionStorage state.",
  "frontend/src/utils/recordingDayIndex.ts": "Converts and validates UI and backend day indices for recording operations.",
  "frontend/src/utils/recordingDiagnostics.ts": "Logs upload attempts, failures, and successes with sanitized metadata and build/version info.",
  "frontend/src/utils/recordingIds.ts": "Defines canonical assignment IDs and provides helpers to validate, normalize, and assert them.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Extracts, classifies, and sanitizes error messages into safe, user‑friendly output.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them when needed.",
  "frontend/src/utils/versionCheck.ts": "Checks the running app version against the latest deployed version by fetching fresh HTML and reports if a refresh is needed.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project’s state, known deployment cache issues, and the need for a rebuild to refresh the live environment."
}