{
  "backend/main.mo": "Motoko canister implementing user profiles and social challenges with access control, including challenge creation, participation checks, invitation codes, and blob-based recording storage, enforced by role-based authorization.",
  "feature_evidence.json": "Structured report describing implemented frontend features, affected files, dependencies, test requirements, and confidence levels for multiple challenge-related UI and routing steps.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all frontend source files, documenting app structure, hooks, components, screens, styling, and i18n setup.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark themes, and base styles with RTL-aware utilities for consistent theming across the app.",
  "frontend/index.html": "Minimal HTML entry document that mounts the React application and loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Root React component managing authentication-aware, state-based screen routing between placeholders, manage challenge, and in-challenge screens.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing a centered, card-style app container with a dynamically positioned language switcher based on text direction.",
  "frontend/src/components/AuthButton.tsx": "Authentication control button integrating Internet Identity login/logout with translated labels and React Query cache clearing.",
  "frontend/src/components/DevPanel.tsx": "Developer-only diagnostics panel showing authentication state, principal ID, and controls to refresh cached backend challenge state.",
  "frontend/src/components/InfoPopups.tsx": "Renders two informational dialog popups using buttons and modals, with all text sourced from the i18n translation context.",
  "frontend/src/components/LanguageSwitcher.tsx": "Provides a dropdown menu to switch application language, updating the i18n context and respecting text direction (LTR/RTL).",
  "frontend/src/components/QueryStateGate.tsx": "Generic wrapper component that handles loading, error, and success states for React Query results and renders retry UI on failure.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAudioRecording.ts": "Custom hook for recording audio via the browser MediaRecorder API, managing recording state, errors, and returning a recorded audio Blob.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Derives authentication status and principal string from the Internet Identity context.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication, handling login, logout, persisted identities, and login state tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks and mutations for user profiles, challenge lifecycle, and related backend interactions using the actor.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Defines a React Query hook to fetch the authenticated user's challenge status from the backend actor.",
  "frontend/src/i18n/i18n.ts": "Empty or placeholder file for i18n-related setup or future configuration.",
  "frontend/src/i18n/I18nContext.tsx": "Provides an i18n context with language selection, translation lookup, persistence in localStorage, and automatic document direction updates.",
  "frontend/src/i18n/index.ts": "Empty or placeholder index file for exporting i18n modules.",
  "frontend/src/i18n/locales/en.json": "English translation locale file; content not shown in this snippet.",
  "frontend/src/i18n/locales/es.json": "Spanish translation locale file; content not shown in this snippet.",
  "frontend/src/i18n/translations.ts": "Defines the main i18n translation dictionary for the app, covering UI text for multiple screens and features across several major languages including RTL support.",
  "frontend/src/index.css": "Configures Tailwind CSS base, theme variables for light/dark modes, global typography, and RTL-aware layout utilities.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with React Query and Internet Identity providers and imports global styles.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Landing screen placeholder showing the app title, feature highlights, authentication CTA, and footer using translated strings.",
  "frontend/src/screens/Screen3Placeholder.tsx": "Placeholder screen for authenticated users without an active challenge, handling join-by-invitation flow with URL/session persistence and mutation hooks.",
  "frontend/src/screens/Screen4Placeholder.tsx": "Placeholder for creating and managing a challenge, including start date selection, invitation code generation, participant management, and creator actions.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Management screen for an active challenge that lists participants, supports refresh, and allows the user to leave the challenge.",
  "frontend/src/screens/Screen5Placeholder.tsx": "Simple placeholder screen describing the challenge state and next steps, with optional navigation to an edit/manage view.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Implements the main in-challenge screen where creators record, save, play, and delete audio reflections for fixed daily assignments, and view participant recordings. It coordinates challenge context, participant selection, day navigation, audio recording/playback, and related API queries/mutations.",
  "frontend/src/utils/assignments.ts": "Defines the fixed set of five assignment templates reused across each day of the 7-day challenge, including IDs, titles, and detailed instructions. Also exports shared types and helpers related to assignment structure.",
  "frontend/src/utils/challengeContext.ts": "Provides helpers to persist, retrieve, and clear the active challenge ID in sessionStorage so challenge context survives page refreshes. Used primarily to restore state for non-creators.",
  "frontend/src/utils/invitationCodes.ts": "Generates random, human-friendly uppercase alphanumeric invitation codes with ambiguous characters removed. Used for challenge invitation flows.",
  "frontend/src/utils/invitationLinks.ts": "Builds, parses, and clears shareable invitation URLs containing challenge IDs and invitation codes. Handles URL query parameters without requiring a page reload.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Normalizes error messages for display and suppresses a known bogus migration message by replacing it with a generic error. Accepts unknown error shapes and extracts a user-friendly string.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters across both query-string and hash-based routing. Supports sessionStorage fallback to keep parameters available across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens via CSS variables, animations, and layout defaults. Enables dark mode via class and registers typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing the Social Contemplation ICP full‑stack dapp, including its core concept, UX/navigation rules, and detailed list of implemented backend/frontend features (auth, actor lifecycle, RBAC, profiles, challenges, recordings, i18n)."
}