{
  "backend/main.mo": "Main backend actor defining challenge, recording, chat, and user profile types with access control, storage mixins, build info, assignment metadata, and partially shown query methods.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, titles, related files, components, tests, and confidence levels for versioning and diagnostics features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of numerous frontend source files for quick reference.",
  "frontend/.gitignore": "Git ignore rules for dependencies, build outputs, environment files, IDE metadata, OS junk files, logs, testing artifacts, and caches.",
  "frontend/index.css": "Thin wrapper stylesheet re-exporting the main CSS from src/index.css.",
  "frontend/index.html": "HTML entry point setting meta tags including cache-busting and app-version placeholder and loading the Vite main.tsx module.",
  "frontend/scripts/generateAppVersion.mjs": "Build script generating a unique version string, writing it to .env.local and a generated TypeScript module with runtime fallback logic.",
  "frontend/src/App.tsx": "Main React app component coordinating authentication, challenge state, URL-synced navigation, version stamping, update guard, and optional developer panel.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing centered mobile-style container and invoking the migration banner suppression hook.",
  "frontend/src/components/AppUpdatingNotice.tsx": "Full-screen notice shown during forced refresh when a version mismatch is detected.",
  "frontend/src/components/AssignmentDetailText.tsx": "Renders multiline assignment text and bolds lines starting with step labels like “Step 1:”.",
  "frontend/src/components/AudioRecorder.tsx": "Audio recording UI that handles recording, playback, errors, and upload flow with a share dialog.",
  "frontend/src/components/AuthButton.tsx": "Authentication button that manages Internet Identity login/logout and query cache clearing.",
  "frontend/src/components/AuthIconButton.tsx": "Compact icon-based login/logout control using Internet Identity with loading states.",
  "frontend/src/components/AutoInvitationRedeemGate.tsx": "Gate component that auto-redeems invitation codes and manages loading, success, and error states.",
  "frontend/src/components/ChallengeChatTab.tsx": "Challenge chat interface supporting message send, edit, reply, live updates, and participant name resolution.",
  "frontend/src/components/ChallengeDeletedNotice.tsx": "Dismissible alert dialog showing translated content when a challenge is deleted.",
  "frontend/src/components/ChatReplyReference.tsx": "Displays a referenced message preview with sender name for chat replies, fetching data as needed.",
  "frontend/src/components/DevPanel.tsx": "Developer diagnostics panel showing auth info, version data, and debugging actions like cache refresh.",
  "frontend/src/components/InfoPopups.tsx": "Renders two info popups using SharedPopup, pulling localized text and section data from translation keys.",
  "frontend/src/components/LanguageSwitcher.tsx": "Empty file with no implementation.",
  "frontend/src/components/PopupBodySections.tsx": "Displays a list of sections with optional headings and formatted paragraph content.",
  "frontend/src/components/ProfileCompletionGate.tsx": "Blocks child content until the user profile has a name, showing a form to submit it if missing.",
  "frontend/src/components/QueryStateGate.tsx": "Wraps a react-query result to show loading, error, or child render based on query state.",
  "frontend/src/components/RecordingFeedback.tsx": "Empty file with no implementation.",
  "frontend/src/components/RecordingLevelMeter.tsx": "Shows a colored audio level meter with percentage based on a normalized level value.",
  "frontend/src/components/RecordingPlayer.tsx": "Audio player component with play/pause controls, seek slider, and time display for a given audio URL.",
  "frontend/src/components/RecordingWaveform.tsx": "Empty file with no implementation.",
  "frontend/src/components/SharedPopup.tsx": "Reusable dialog wrapper providing consistent layout, scroll behavior, and trigger handling.",
  "frontend/src/components/ThemeToggle.tsx": "Button that toggles between light and dark themes using useTheme.",
  "frontend/src/generated/appVersion.ts": "Generates and exports a build version value using Vite env variables or a runtime fallback.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useAppUpdateGuard.ts": "Checks for version mismatches on startup and triggers a one-time hard refresh if needed.",
  "frontend/src/hooks/useAudioRecording.ts": "Provides audio recording state and controls with live level analysis, timers, and cleanup handling.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Returns authentication state and principal data derived from Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, loading stored identities, and exposing login state helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, challenge data, recordings, and chat messages via an actor API.",
  "frontend/src/hooks/useSuppressMigrationBanner.ts": "Uses a MutationObserver to detect and hide a recurring migration banner in the DOM.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with localStorage persistence and toggling.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Fetches the authenticated user’s challenge status using React Query and actor API.",
  "frontend/src/i18n/i18n.ts": "Empty file placeholder for i18n setup.",
  "frontend/src/i18n/I18nContext.tsx": "Implements a simple i18n provider exposing a translation function using predefined English translations.",
  "frontend/src/i18n/index.ts": "Empty index file for i18n exports.",
  "frontend/src/i18n/locales/en.json": "Empty English locale JSON placeholder.",
  "frontend/src/i18n/locales/es.json": "Empty Spanish locale JSON placeholder.",
  "frontend/src/i18n/translations.ts": "Contains translation dictionaries for multiple languages, currently providing full English text for the app.",
  "frontend/src/index.css": "Tailwind-based global styles configuring color variables, dark mode, and component styles.",
  "frontend/src/main.tsx": "Application entry point mounting the app with Internet Identity and React Query providers.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Empty placeholder component file for Screen 1.",
  "frontend/src/screens/Screen3Placeholder.tsx": "UI placeholder for screen 3 showing no active challenge, recovery actions, and navigation to challenge creation.",
  "frontend/src/screens/Screen4Placeholder.tsx": "Placeholder for challenge creation and management with date setup, invitation codes, participant controls, and challenge lifecycle actions.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Empty file with no implementation.",
  "frontend/src/screens/Screen5Placeholder.tsx": "Simple placeholder showing challenge state info with optional edit navigation and info popups.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Main in-challenge screen handling day navigation, recordings, chat, participant data, and URL state syncing.",
  "frontend/src/screens/UnifiedEntryMenu.tsx": "Entry screen determining login or challenge actions based on user status, with theme/auth controls and info popups.",
  "frontend/src/utils/appUrlState.ts": "Utilities for reading, writing, and clearing navigation state stored in URL query parameters.",
  "frontend/src/utils/appVersion.ts": "Helpers for reading, validating, extracting, and stamping app version metadata with fallback handling for placeholders.",
  "frontend/src/utils/assignments.ts": "Defines the fixed 5 daily assignments for the 7‑day challenge with canonical IDs, titles, and content.",
  "frontend/src/utils/backendBuildInfo.ts": "Caches backend build info in memory and provides helper accessors and a short identifier string.",
  "frontend/src/utils/challengeContext.ts": "Stores, retrieves, and clears the active challenge ID in sessionStorage.",
  "frontend/src/utils/challengeDayFormat.ts": "Formats a challenge day header using start time and day index, falling back gracefully on errors.",
  "frontend/src/utils/challengeDeletedNotice.ts": "Manages a sessionStorage flag indicating whether a challenge‑deleted notice should be shown.",
  "frontend/src/utils/challengeRecovery.ts": "Resets all client challenge state by clearing storage, URL state, and invalidating related React Query caches.",
  "frontend/src/utils/hardRefresh.ts": "Performs a cache‑busted hard refresh with loop protection and exposes helpers to trigger or clear it.",
  "frontend/src/utils/invitationCodes.ts": "Generates random uppercase invitation codes using a non‑ambiguous character set.",
  "frontend/src/utils/invitationLinks.ts": "Builds, parses, persists, and clears invitation URL parameters and sessionStorage‑stored invitation data.",
  "frontend/src/utils/recordingDayIndex.ts": "Converts between UI (1–7) and backend (0–6) day indices with validation helpers.",
  "frontend/src/utils/recordingDiagnostics.ts": "Logs recording upload attempts, failures, and successes with minimal sanitized metadata for debugging.",
  "frontend/src/utils/recordingIds.ts": "Defines canonical assignment IDs, validates them, and provides normalization and assertion utilities for recording operations.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Provides helpers to extract and classify error messages and map them to safe, user‑friendly strings.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/src/utils/versionCheck.ts": "Fetches the latest HTML to compare build versions and determine if a refresh is needed, with a legacy wrapper for compatibility.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and layout settings with plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing build-version issues, existing features, and requirements for fixing stale frontend asset problems."
}