{
  "backend/main.mo": "Actor implementing challenge management with user profiles, access control, chat, recordings, and invitation handling using multiple storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report describing the day‑index normalization fix and listing related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files outlining their responsibilities and architecture.",
  "frontend/index.css": "Delegates stylesheet loading to the main theme file at src/index.css.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx and containing the root mount point.",
  "frontend/src/App.tsx": "Top‑level app component handling auth flow, profile gating, invitation auto‑redeem, challenge deletion notice, and URL‑synced navigation between main screens.",
  "frontend/src/components/AppShell.tsx": "Responsive centered layout container that constrains content to a mobile‑sized card with scroll handling.",
  "frontend/src/components/AuthButton.tsx": "Login/logout button integrating Internet Identity with translated states and React Query cache clearing.",
  "frontend/src/components/AuthIconButton.tsx": "Compact icon‑only auth control supporting Internet Identity login/logout and loading indicators.",
  "frontend/src/components/AutoInvitationRedeemGate.tsx": "Gate that auto‑detects and redeems persisted invitation parameters, handling loading, success, error states, and query invalidation.",
  "frontend/src/components/ChallengeChatTab.tsx": "Chat UI for challenges supporting message fetching, sending, editing, replying, and auto‑scrolling with participant name resolution.",
  "frontend/src/components/ChallengeDeletedNotice.tsx": "Dismissible alert dialog shown when a challenge is deleted.",
  "frontend/src/components/ChatReplyReference.tsx": "Displays a referenced message preview and author name for chat replies, fetching from cache or network.",
  "frontend/src/components/DevPanel.tsx": "Optional developer debug panel showing auth state and allowing cache invalidation.",
  "frontend/src/components/InfoPopups.tsx": "Renders two informational popup dialogs using translations for challenge and social contemplation details.",
  "frontend/src/components/LanguageSwitcher.tsx": "Empty placeholder component file.",
  "frontend/src/components/ProfileCompletionGate.tsx": "Blocks app until the user completes their profile name, showing a form and handling profile save logic.",
  "frontend/src/components/QueryStateGate.tsx": "Wrapper that handles query loading and error states before rendering children.",
  "frontend/src/components/RecordingFeedback.tsx": "Empty placeholder component file.",
  "frontend/src/components/SharedPopup.tsx": "Reusable dialog wrapper providing consistent layout and scroll behavior.",
  "frontend/src/components/ThemeToggle.tsx": "Button to toggle between light and dark themes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useAudioRecording.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Returns authentication status, principal string, and identity from Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, including identity loading, login, logout, and status management. Wraps AuthClient with custom options and exposes a hook to access auth state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks and query keys for fetching and mutating user profiles, challenge data, recordings, and chat messages through the backend actor. Centralizes query key constants for consistent cache invalidation.",
  "frontend/src/hooks/useTheme.ts": "Implements a light/dark theme hook that syncs with localStorage and system preferences and toggles the document’s theme class. Provides a simple toggle function and current theme state.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Fetches the authenticated user’s challenge status using React Query when an actor is available. Retries up to two times and caches the result for 30 seconds.",
  "frontend/src/i18n/i18n.ts": "Empty placeholder file for future i18n setup.",
  "frontend/src/i18n/I18nContext.tsx": "Provides a minimal i18n context with an English-only translation function and sets document language and direction. Includes nested key lookup and a hook to access translations.",
  "frontend/src/i18n/index.ts": "Empty barrel file reserved for future i18n exports.",
  "frontend/src/i18n/locales/en.json": "Empty JSON placeholder for English translations.",
  "frontend/src/i18n/locales/es.json": "Empty JSON placeholder for Spanish translations.",
  "frontend/src/i18n/translations.ts": "Contains a large English translation dictionary covering app text, UI labels, and multi-language metadata stubs. Serves as the primary source for the translation keys used in the UI.",
  "frontend/src/index.css": "Tailwind base styles plus custom theme variables for light and dark modes, with global resets and layout rules. Defines CSS variables used throughout the app.",
  "frontend/src/main.tsx": "App entry point that initializes React, sets up React Query, and wraps the app with the Internet Identity provider. Imports global styles and renders the root component.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Empty placeholder for the Screen 1 component.",
  "frontend/src/screens/Screen3Placeholder.tsx": "Displays the state for authenticated users without an active challenge, offering creation, refresh, and recovery actions. Uses translations and UI components to render a placeholder screen.",
  "frontend/src/screens/Screen4Placeholder.tsx": "Large placeholder screen for creating or managing a challenge, handling start dates, invitation codes, participants, and challenge mutations.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Empty file placeholder for a future challenge‑management screen.",
  "frontend/src/screens/Screen5Placeholder.tsx": "UI placeholder showing challenge state info with optional navigation to an edit screen.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Main in‑challenge screen handling tabs, recordings, participants, day logic, and error recovery for missing challenges.",
  "frontend/src/screens/UnifiedEntryMenu.tsx": "Entry menu determining user state and routing to login, challenge creation, active challenge, or management.",
  "frontend/src/utils/appUrlState.ts": "Utilities for reading, writing, and clearing app state from URL query parameters.",
  "frontend/src/utils/assignments.ts": "Defines the fixed set of 7‑day challenge assignments with titles and detailed content.",
  "frontend/src/utils/challengeContext.ts": "Session‑based persistence for storing and retrieving the active challenge ID.",
  "frontend/src/utils/challengeDayFormat.ts": "Formats challenge day headers using start time and day index into human‑readable dates.",
  "frontend/src/utils/challengeDeletedNotice.ts": "Session‑stored flag helpers for tracking when a challenge‑deleted notice should be shown.",
  "frontend/src/utils/challengeRecovery.ts": "Resets all challenge-related client state by clearing persisted IDs, URL state, and invalidating/removing React Query caches.",
  "frontend/src/utils/invitationCodes.ts": "Generates a random uppercase alphanumeric invitation code using a restricted character set.",
  "frontend/src/utils/invitationLinks.ts": "Builds, parses, persists, and clears challenge invitation link parameters while preserving app navigation state.",
  "frontend/src/utils/recordingDayIndex.ts": "Converts day numbers between UI (1–7) and backend (0–6) formats with clamping.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Normalizes backend error messages, blocks the migration message, and maps common errors to user-friendly text.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters across query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, container settings, and plugin integrations.",
  "project_state.json": "No summary available."
}