{
  "backend/main.mo": "Defines the main actor for challenge management, including types, storage mixins, authorization, assignment mappings, and build metadata.",
  "feature_evidence.json": "Lists features, related files, components, and test IDs for audio upload removal and recorder usability requirements.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files describing their roles in navigation, state management, i18n, styling, and UI components.",
  "frontend/index.css": "Re-exports the main stylesheet by importing the authoritative theme token CSS.",
  "frontend/index.html": "HTML entry point loading the React app with cache-busting meta tags and injected build version.",
  "frontend/src/App.tsx": "Main app component handling auth state, challenge status, URL-synced navigation, update detection, and gated flows.",
  "frontend/src/components/AppShell.tsx": "Provides the layout wrapper with a centered mobile-style container and suppresses the migration banner.",
  "frontend/src/components/AppUpdatingNotice.tsx": "Shows a blocking loading notice when the app detects a version mismatch and refreshes.",
  "frontend/src/components/AssignmentDetailText.tsx": "Renders multiline assignment text with bold step headers while preserving line breaks.",
  "frontend/src/components/AudioRecorder.tsx": "Implements in‑app audio recording, review, and save workflow without exposing upload‑from‑file controls.",
  "frontend/src/components/AuthButton.tsx": "Authentication button handling Internet Identity login/logout states with translated labels.",
  "frontend/src/components/AuthIconButton.tsx": "Icon-only button that triggers Internet Identity login/logout and clears cached data on logout.",
  "frontend/src/components/AutoInvitationRedeemGate.tsx": "Automatically redeems persisted invitation codes when eligible and shows loading/error states during the process.",
  "frontend/src/components/ChallengeChatTab.tsx": "Full chat interface with message posting, editing, replies, participant name resolution, and auto-scrolling.",
  "frontend/src/components/ChallengeDeletedNotice.tsx": "Popup dialog informing the user that a challenge was deleted and allowing dismissal.",
  "frontend/src/components/ChatReplyReference.tsx": "Displays a referenced message preview with sender name resolution for chat replies.",
  "frontend/src/components/DevPanel.tsx": "Developer debugging panel showing auth state and enabling query refresh; not enabled by default.",
  "frontend/src/components/InfoPopups.tsx": "Provides two info popups with translated content for social contemplation and challenge details.",
  "frontend/src/components/LanguageSwitcher.tsx": "Empty placeholder file for a language switcher component.",
  "frontend/src/components/PopupBodySections.tsx": "Renders a list of popup sections with optional headings and formatted content.",
  "frontend/src/components/ProfileCompletionGate.tsx": "Gate that requires users to complete their profile name before accessing the app, showing a form when missing.",
  "frontend/src/components/QueryStateGate.tsx": "Wrapper that displays loading or error states for a query before rendering its children with fetched data.",
  "frontend/src/components/RecordingFeedback.tsx": "Empty placeholder file for recording feedback functionality.",
  "frontend/src/components/RecordingLevelMeter.tsx": "Renders a visual audio level meter with color-coded bar based on normalized level value.",
  "frontend/src/components/RecordingPlayer.tsx": "Implements an audio player with play/pause, seek slider, and time display using an HTMLAudioElement.",
  "frontend/src/components/RecordingWaveform.tsx": "Empty placeholder file for a waveform component.",
  "frontend/src/components/SharedPopup.tsx": "Provides a reusable dialog wrapper with consistent layout, scrolling, and trigger behavior using shadcn UI components.",
  "frontend/src/components/ThemeToggle.tsx": "Button component that toggles between light and dark themes using a custom theme hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAppUpdateGuard.ts": "Checks app version on startup and triggers a one-time hard refresh if mismatched, preventing refresh loops.",
  "frontend/src/hooks/useAudioRecording.ts": "Manages microphone recording with live audio level analysis, timers, and cleanup, returning recording state and controls.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Exposes authentication state and principal string derived from Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and auth client configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions including user profiles, challenges, recordings, and chat messages.",
  "frontend/src/hooks/useSuppressMigrationBanner.ts": "React hook that observes DOM mutations and hides elements containing a specific migration banner message.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with localStorage persistence and applies the theme to the document root.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Fetches the user's challenge status using react-query, enabled only when authentication and actor availability conditions are met.",
  "frontend/src/i18n/i18n.ts": "Empty placeholder file.",
  "frontend/src/i18n/I18nContext.tsx": "Provides a translation context with a simple key‑based lookup and forces English/LTR document settings.",
  "frontend/src/i18n/index.ts": "Empty placeholder file.",
  "frontend/src/i18n/locales/en.json": "Empty English locale file.",
  "frontend/src/i18n/locales/es.json": "Empty Spanish locale file.",
  "frontend/src/i18n/translations.ts": "Defines the full English translation dictionary for the app, including UI text for multiple screens.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling for the app.",
  "frontend/src/main.tsx": "App entry point that mounts React, sets up react‑query, Internet Identity, and global styles.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Empty placeholder file for Screen 1.",
  "frontend/src/screens/Screen3Placeholder.tsx": "Displays the no‑challenge state with refresh, navigation to challenge creation, and translated UI text.",
  "frontend/src/screens/Screen4Placeholder.tsx": "Implements challenge creation and management UI, including codes, participants, start time, and various mutations.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Empty placeholder file.",
  "frontend/src/screens/Screen5Placeholder.tsx": "Shows a placeholder manage‑challenge screen with state info, edit navigation, and info popups.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Main challenge screen handling tabs, day selection, participant views, audio recording upload/delete, and challenge-not-found recovery.",
  "frontend/src/screens/UnifiedEntryMenu.tsx": "Landing menu that decides whether to login, create a challenge, or enter an active one based on auth and user status.",
  "frontend/src/utils/appUrlState.ts": "Reads, writes, and clears navigation-related URL parameters without reloading the page.",
  "frontend/src/utils/appVersion.ts": "Extracts and validates the frontend app version from meta tags or fetched HTML, rejecting placeholders.",
  "frontend/src/utils/assignments.ts": "Defines the fixed 7‑day challenge assignment list with canonical IDs and updated content.",
  "frontend/src/utils/backendBuildInfo.ts": "Caches backend build info and exposes helpers to store, retrieve, clear, and format a short build identifier.",
  "frontend/src/utils/challengeContext.ts": "Stores, retrieves, and clears the active challenge ID in sessionStorage.",
  "frontend/src/utils/challengeDayFormat.ts": "Formats a challenge day number into a human-readable weekday and date based on start time.",
  "frontend/src/utils/challengeDeletedNotice.ts": "Persists a flag in sessionStorage indicating that a challenge was deleted and should show a notice.",
  "frontend/src/utils/challengeRecovery.ts": "Resets all client-side challenge state by clearing storage, URL state, and invalidating related React Query caches.",
  "frontend/src/utils/hardRefresh.ts": "Provides a loop-protected, cache‑busted hard refresh and a helper to clear the protection flag.",
  "frontend/src/utils/invitationCodes.ts": "Generates random uppercase invitation codes using an unambiguous character set.",
  "frontend/src/utils/invitationLinks.ts": "Builds, parses, clears, and persists invitation link params using URL and sessionStorage.",
  "frontend/src/utils/recordingDayIndex.ts": "Converts and validates UI day values and backend day values between 1–7 and 0–6.",
  "frontend/src/utils/recordingDiagnostics.ts": "Logs upload attempts, failures, and successes with minimal diagnostic context.",
  "frontend/src/utils/recordingIds.ts": "Defines canonical recording assignment IDs and helpers to validate, assert, and normalize them.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Extracts, classifies, and sanitizes error messages into safe user‑facing text.",
  "frontend/src/utils/urlParams.ts": "Reads, stores, persists, and clears URL parameters from query strings and hash routing.",
  "frontend/src/utils/versionCheck.ts": "Fetches the latest app HTML to compare versions and determine if a refresh is needed.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom theme extensions for colors, radii, shadows, animations, and includes typography, container query, and animation plugins.",
  "project_state.json": "Project state metadata describing audio upload removal, recorder improvements, assignment name updates, and pending feature requests with architectural notes and known issues."
}