{
  "backend/main.mo": "Defines core challenge, user profile, chat, and storage logic with authorization checks and invite-link integration for managing challenge lifecycle and user data.",
  "feature_evidence.json": "Lists feature changes, affected files, components, and test IDs for recent UI and text‑update requirements with high‑confidence evidence entries.",
  "frontend-file-summaries.txt": "Aggregates prewritten summaries of all frontend files, describing their roles in navigation, layout, hooks, translations, and UI components.",
  "frontend/index.css": "Thin wrapper that re-exports the main theme stylesheet from src/index.css.",
  "frontend/index.html": "Basic HTML document bootstrapping the React app and loading main.tsx into the root div.",
  "frontend/src/App.tsx": "Top-level app controller handling authentication state, URL-synced screen navigation, challenge status loading, and invitation processing.",
  "frontend/src/components/AppShell.tsx": "Provides the centered mobile-style layout container with scrollable content region for all screens.",
  "frontend/src/components/AssignmentDetailText.tsx": "Renders assignment text with automatic bolding of 'Step X:' headings while preserving line structure and spacing.",
  "frontend/src/components/AuthButton.tsx": "Login/logout button using Internet Identity with translated states and query cache clearing on logout.",
  "frontend/src/components/AuthIconButton.tsx": "Compact icon-based authentication control handling Internet Identity login/logout with loading indicators and cache reset.",
  "frontend/src/components/AutoInvitationRedeemGate.tsx": "Automatically redeems persisted invitation codes when conditions are met, showing loading and error states. Refreshes related queries and clears stored invitation data after redemption.",
  "frontend/src/components/ChallengeChatTab.tsx": "Renders challenge chat UI with message sending, editing, replying, scrolling, and participant name resolution. Fetches messages with polling and handles local input state and errors.",
  "frontend/src/components/ChallengeDeletedNotice.tsx": "Displays a dismissible dialog informing the user that a challenge was deleted. Uses translations and structured popup body sections.",
  "frontend/src/components/ChatReplyReference.tsx": "Shows a preview of a replied‑to chat message, resolving sender names and fetching the message if not cached. Falls back gracefully when the referenced message is missing.",
  "frontend/src/components/DevPanel.tsx": "Developer-only panel showing auth state and allowing manual query refresh. Not rendered by default and used for debugging.",
  "frontend/src/components/InfoPopups.tsx": "Provides buttons that open informational popups based on translation content. Uses SharedPopup and PopupBodySections for structured info dialogs.",
  "frontend/src/components/LanguageSwitcher.tsx": "Empty placeholder file for a future language switcher component.",
  "frontend/src/components/PopupBodySections.tsx": "Renders arrays of section objects with optional headings and formatted text for popup content. Supports structured, scroll-friendly popup layouts.",
  "frontend/src/components/ProfileCompletionGate.tsx": "Blocks app content until the user completes their profile by entering a name. Handles profile fetching, validation, submission, and loading states.",
  "frontend/src/components/QueryStateGate.tsx": "Provides standardized loading and error UI for React Query results. Renders children only when data is successfully loaded.",
  "frontend/src/components/RecordingFeedback.tsx": "Empty placeholder file for future recording feedback UI.",
  "frontend/src/components/SharedPopup.tsx": "Wrapper around dialog components providing consistent sizing, scrolling, and structure for all popups. Accepts a trigger, title, description, and content.",
  "frontend/src/components/ThemeToggle.tsx": "Simple theme toggle button that switches between light and dark modes. Uses icons to reflect the current theme.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAudioRecording.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Returns authentication status and the authenticated principal string from Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query keys and hooks for fetching and mutating user profiles, challenge status, recordings, and chat data via the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with persistence and system preference fallback.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Fetches the authenticated user’s challenge status using the backend actor.",
  "frontend/src/i18n/i18n.ts": "Empty file with no implementation.",
  "frontend/src/i18n/I18nContext.tsx": "Implements a simple i18n provider with English translations and a lookup helper.",
  "frontend/src/i18n/index.ts": "Empty file with no implementation.",
  "frontend/src/i18n/locales/en.json": "Empty translation file placeholder for English locale.",
  "frontend/src/i18n/locales/es.json": "Empty translation file placeholder for Spanish locale.",
  "frontend/src/i18n/translations.ts": "Defines a comprehensive English translation dictionary for UI text across multiple screens.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light/dark themes and layout resets.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Empty placeholder file for Screen 1.",
  "frontend/src/screens/Screen3Placeholder.tsx": "UI placeholder for the no-active-challenge state, offering recovery, navigation, and localized text.",
  "frontend/src/screens/Screen4Placeholder.tsx": "Placeholder screen for creating and managing challenges with date selection, invitation codes, participant management, and challenge lifecycle actions.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Empty file with no implemented content.",
  "frontend/src/screens/Screen5Placeholder.tsx": "Simple placeholder screen showing challenge state info, an optional edit button, and info popups.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Main in‑challenge screen handling tabs, day selection, audio uploads, playback, participant browsing, and challenge state recovery.",
  "frontend/src/screens/UnifiedEntryMenu.tsx": "Entry menu determining user flow based on authentication and challenge status, with login, create, manage, and info actions.",
  "frontend/src/utils/appUrlState.ts": "Utility for reading, writing, and clearing navigation state in URL search parameters.",
  "frontend/src/utils/assignments.ts": "Defines the fixed set of 7‑day challenge assignments with titles and detailed instructional content.",
  "frontend/src/utils/challengeContext.ts": "Session storage helper for persisting and retrieving the active challenge ID.",
  "frontend/src/utils/challengeDayFormat.ts": "Formats challenge day headers using start time and day index, converting backend timestamps to readable dates.",
  "frontend/src/utils/challengeDeletedNotice.ts": "Session storage utility for setting, checking, and clearing a 'challenge deleted' notice flag.",
  "frontend/src/utils/challengeRecovery.ts": "Resets all client-side challenge state by clearing persisted IDs, URL state, and invalidating/removing related React Query caches.",
  "frontend/src/utils/invitationCodes.ts": "Generates a random uppercase alphanumeric invitation code using a restricted character set.",
  "frontend/src/utils/invitationLinks.ts": "Builds, parses, clears, and persists invitation link parameters using URL manipulation and sessionStorage.",
  "frontend/src/utils/recordingDayIndex.ts": "Converts day numbers between UI (1–7) and backend (0–6) formats with clamping.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Sanitizes error messages, blocks a known migration message, and maps common backend errors to user-friendly text.",
  "frontend/src/utils/urlParams.ts": "Extracts, stores, persists, and clears URL parameters across query and hash routing using sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining colors, containers, animations, and plugins for the frontend UI.",
  "project_state.json": "Project state file describing schema version, high-level app summary, and a catalog of existing features with metadata."
}