{
  "backend/main.mo": "Defines access-controlled user profiles and challenge management, including creation, status checks, participant handling, and blob-backed recordings.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for many frontend files, describing their roles in routing, i18n, UI, and state management.",
  "frontend/index.css": "Tailwind-based global theme tokens and dark mode variables defining color system and layout defaults.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component handling auth, challenge status, URL-synced screen navigation, and rendering appropriate screens.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing centered container, responsive scroll area, and RTL-aware language switcher placement.",
  "frontend/src/components/AuthButton.tsx": "Authentication button integrating Internet Identity with translated labels, login/logout logic, and loading states.",
  "frontend/src/components/DevPanel.tsx": "Developer diagnostics panel showing auth state, principal, and controls for login/logout and query refresh.",
  "frontend/src/components/InfoPopups.tsx": "Renders two translated info popups using SharedPopup with detailed content sections. Provides buttons that open dialogs for social contemplation and challenge information.",
  "frontend/src/components/LanguageSwitcher.tsx": "Dropdown button allowing users to switch the app language using available translation codes. Updates language and respects RTL direction.",
  "frontend/src/components/QueryStateGate.tsx": "Wrapper component that handles loading and error states for react-query results. Shows loaders or error messages before rendering children with query data.",
  "frontend/src/components/RecordingFeedback.tsx": "Displays live recording feedback including timer, mic pulse animation, audio level meter, and reassurance text. Reacts to audio level and RTL direction and hides when not visible.",
  "frontend/src/components/SharedPopup.tsx": "Reusable dialog wrapper providing consistent layout, scrolling, and RTL support. Wraps shadcn Dialog components and renders provided trigger and content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, initializing admin access when applicable. Invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAudioRecording.ts": "Hook managing audio recording, producing a blob, tracking audio level and elapsed time, and handling cleanup. Uses MediaRecorder and Web Audio API for live feedback.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Returns authentication status and principal string from Internet Identity. Determines if the identity is non-anonymous.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identity loading, and status flags. Wraps AuthClient setup and exposes login and clear actions.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, challenge status, active challenge IDs, and related mutation helpers.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Standalone hook fetching the user's challenge status via React Query.",
  "frontend/src/i18n/i18n.ts": "Empty placeholder file.",
  "frontend/src/i18n/I18nContext.tsx": "Provides i18n context, language persistence, translation lookup, and document direction updates.",
  "frontend/src/i18n/index.ts": "Empty placeholder file.",
  "frontend/src/i18n/locales/en.json": "Empty English locale file placeholder.",
  "frontend/src/i18n/locales/es.json": "Empty Spanish locale file placeholder.",
  "frontend/src/i18n/translations.ts": "Defines the full translation dictionary for multiple languages and app text sections.",
  "frontend/src/index.css": "Global Tailwind CSS setup with theming variables, dark mode, and RTL-aware utilities.",
  "frontend/src/main.tsx": "App entry point initializing React Query, identity provider, styles, and rendering App.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Placeholder UI for the landing screen showing app intro text, features, and login CTA using i18n.",
  "frontend/src/screens/Screen3Placeholder.tsx": "Placeholder screen for users without an active challenge, handling invite parsing, join flow, and state refresh.",
  "frontend/src/screens/Screen4Placeholder.tsx": "UI for creating and managing a challenge, including date selection, invitation codes, participant management, and creator/participant actions.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Displays current challenge participants with refresh and leave functionality, handling missing challenge state recovery.",
  "frontend/src/screens/Screen5Placeholder.tsx": "Static placeholder view showing challenge info, edit navigation, and informational popups.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Main in-challenge screen handling tabs, day navigation, participant selection, audio recording, playback, and URL state sync.",
  "frontend/src/utils/appUrlState.ts": "Reads, writes, and clears app navigation state from URL search parameters while preserving other query parameters.",
  "frontend/src/utils/assignments.ts": "Defines the fixed 7‑day challenge assignments and their text content used across the app.",
  "frontend/src/utils/challengeContext.ts": "Persists and retrieves the active challenge ID in sessionStorage to maintain context across refreshes.",
  "frontend/src/utils/challengeDayFormat.ts": "Formats a challenge day header using start time and day index to produce readable weekday and date labels.",
  "frontend/src/utils/invitationCodes.ts": "Generates random uppercase alphanumeric invitation codes using a restricted character set.",
  "frontend/src/utils/invitationLinks.ts": "Provides helpers to build, parse, and clear invitation-related URL parameters while preserving navigation state.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Normalizes and sanitizes error messages, blocking a known bogus migration message and mapping common backend errors to user-friendly text.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL parameters from query or hash, persisting them in sessionStorage, and clearing stored or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing the dapp’s features, architecture, and existing functionality for planning and tracking."
}