{
  "backend/main.mo": "Motoko canister managing user profiles, challenges, invite links, chat messages, recordings, and authorization with validation and access control.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs with metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their roles, logic, and architectural responsibilities.",
  "frontend/index.css": "Forwards to the main stylesheet under src to centralize theme tokens.",
  "frontend/index.html": "HTML entry document defining cache-busting headers, app version meta tag, and loading the main React entrypoint.",
  "frontend/src/App.tsx": "Main React app component handling authentication flow, URL‑synced navigation, update guard, and challenge UI routing.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing centered mobile container and invoking migration‑banner suppression.",
  "frontend/src/components/AppUpdatingNotice.tsx": "Overlay notice shown during forced refresh when a version mismatch is detected.",
  "frontend/src/components/AssignmentDetailText.tsx": "Renders assignment text with bolded step headings and preserved line structure.",
  "frontend/src/components/AuthButton.tsx": "Authentication button integrating Internet Identity login/logout with query cache clearing and i18n labels.",
  "frontend/src/components/AuthIconButton.tsx": "Icon‑only authentication control handling login/logout and loading states via Internet Identity.",
  "frontend/src/components/AutoInvitationRedeemGate.tsx": "Automatically checks and redeems stored invitation codes, showing loading or error UI and refreshing challenge-related queries upon success.",
  "frontend/src/components/ChallengeChatTab.tsx": "Handles challenge chat messaging, including sending, editing, replying, auto-scrolling, and resolving sender names via participant profiles.",
  "frontend/src/components/ChallengeDeletedNotice.tsx": "Shows a dismissible dialog informing the user that a challenge was deleted, using translated text and structured popup sections.",
  "frontend/src/components/ChatReplyReference.tsx": "Displays a referenced message snippet in chat replies, fetching it from cache or backend and resolving sender names.",
  "frontend/src/components/DevPanel.tsx": "Developer-only UI showing auth state and allowing react-query state refresh.",
  "frontend/src/components/InfoPopups.tsx": "Renders two informational popups using shared dialog components and translated section content.",
  "frontend/src/components/LanguageSwitcher.tsx": "Empty placeholder component file.",
  "frontend/src/components/PopupBodySections.tsx": "Renders a list of popup sections with optional headings and formatted content.",
  "frontend/src/components/ProfileCompletionGate.tsx": "Blocks app access until the user completes their profile name, providing a form and saving changes via mutation.",
  "frontend/src/components/QueryStateGate.tsx": "Wraps a query to show loading and error states, passing data to children once loaded.",
  "frontend/src/components/RecordingFeedback.tsx": "Empty placeholder component file.",
  "frontend/src/components/SharedPopup.tsx": "Shared dialog wrapper providing consistent sizing and scroll behavior around popup content.",
  "frontend/src/components/ThemeToggle.tsx": "Button that toggles between light and dark themes using a theme hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAppUpdateGuard.ts": "Checks for version mismatches on startup and triggers a safe one-time hard refresh to update the app.",
  "frontend/src/hooks/useAudioRecording.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Exposes authentication status and the user's principal derived from Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity auth context, handling login, stored identities, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines numerous React Query hooks for interacting with backend user, challenge, recording, and chat data.",
  "frontend/src/hooks/useSuppressMigrationBanner.ts": "Hides an unwanted migration banner using targeted DOM inspection and a MutationObserver.",
  "frontend/src/hooks/useTheme.ts": "Stores and toggles light/dark theme preferences using localStorage and system defaults.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Fetches the authenticated user's challenge status through the backend actor.",
  "frontend/src/i18n/i18n.ts": "Empty file with no implementation.",
  "frontend/src/i18n/I18nContext.tsx": "Sets up a simple English-only i18n context with nested key lookup and LTR document settings.",
  "frontend/src/i18n/index.ts": "Empty barrel file with no exports.",
  "frontend/src/i18n/locales/en.json": "Empty file placeholder for English locale data.",
  "frontend/src/i18n/locales/es.json": "Empty file placeholder for Spanish locale data.",
  "frontend/src/i18n/translations.ts": "Contains the full English translation dictionary used by the app, organized by feature sections.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes and applies global layout and typography styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/screens/Screen3Placeholder.tsx": "UI for the no‑active‑challenge state with refresh, recovery, and navigation options, using translations and query invalidation.",
  "frontend/src/screens/Screen4Placeholder.tsx": "Complex create/manage challenge screen handling dates, invitation codes, participants, and challenge mutations.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/screens/Screen5Placeholder.tsx": "Displays basic challenge state info with edit navigation and info popups.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Main in‑challenge screen managing tabs, recordings, participants, upload flows, and challenge state recovery.",
  "frontend/src/screens/UnifiedEntryMenu.tsx": "Entry menu deciding login/create/join actions and showing hero content with auth and settings controls.",
  "frontend/src/utils/appUrlState.ts": "Utility for reading, writing, and clearing custom app state parameters in the URL.",
  "frontend/src/utils/appVersion.ts": "Reads and extracts the app version from meta tags or fetched HTML for version tracking.",
  "frontend/src/utils/assignments.ts": "Defines the fixed 5 daily assignments for the challenge with canonical IDs, titles, and content.",
  "frontend/src/utils/challengeContext.ts": "Stores, retrieves, and clears the active challenge ID in sessionStorage.",
  "frontend/src/utils/challengeDayFormat.ts": "Formats challenge day headers using a start timestamp and day index to produce readable date labels.",
  "frontend/src/utils/challengeDeletedNotice.ts": "Manages a sessionStorage flag indicating whether a challenge-deleted notice should be shown.",
  "frontend/src/utils/challengeRecovery.ts": "Resets all client-side challenge state by clearing storage and invalidating related React Query caches.",
  "frontend/src/utils/hardRefresh.ts": "Performs a cache‑busted hard refresh with loop protection and clears the protection flag when needed.",
  "frontend/src/utils/invitationCodes.ts": "Generates random uppercase alphanumeric invitation codes without ambiguous characters.",
  "frontend/src/utils/invitationLinks.ts": "Builds, parses, persists, and clears challenge invitation URL parameters using sessionStorage and URL manipulation.",
  "frontend/src/utils/recordingDayIndex.ts": "Converts and validates UI day values (1–7) and backend day values (0–6).",
  "frontend/src/utils/recordingDiagnostics.ts": "Logs sanitized upload attempt, failure, and success info for audio recording operations.",
  "frontend/src/utils/recordingIds.ts": "Defines canonical assignment IDs and utilities to validate, assert, and normalize recording identifiers.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Provides utilities to extract and sanitize error messages and map backend errors to user‑friendly strings.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/versionCheck.ts": "Checks whether the running app version matches the latest deployed version and signals if a hard refresh is needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and enabled plugins.",
  "project_state.json": "Project state metadata describing stale‑asset issues, existing features, and pending requirements for improved cache‑busting and versioning."
}