{
  "backend/main.mo": "Main canister actor implementing challenge creation, user profiles, chat, storage mixins, authorization, and invitation logic with state maps and validation.",
  "backend/migration.mo": "Migration module that normalizes legacy day indices and updates stored challenge recordings accordingly.",
  "feature_evidence.json": "Feature evidence report linking a frontend recording-ID consistency update to affected files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files, used as reference for build planning.",
  "frontend/index.css": "Forwards to the main app stylesheet inside src/index.css.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level app controller handling auth state, challenge status, URL-synced navigation, invitation handling, and screen routing.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing centered mobile-like container with scrollable content.",
  "frontend/src/components/AssignmentDetailText.tsx": "Renders multiline assignment text and bolds step headers like 'Step 1:' while preserving spacing.",
  "frontend/src/components/AuthButton.tsx": "Full-size login/logout button using Internet Identity with translated labels and React Query cache clearing.",
  "frontend/src/components/AuthIconButton.tsx": "Compact icon-based login/logout button handling Internet Identity flow with loading icons and cache clearing.",
  "frontend/src/components/AutoInvitationRedeemGate.tsx": "Automatically checks for a stored invitation and redeems it if the user has no active challenge, showing loading or error states as needed.",
  "frontend/src/components/ChallengeChatTab.tsx": "Displays a challenge chat interface with message sending, editing, replying, auto‑scrolling, and participant name resolution.",
  "frontend/src/components/ChallengeDeletedNotice.tsx": "Shows a dismissible alert dialog informing the user that a challenge was deleted.",
  "frontend/src/components/ChatReplyReference.tsx": "Renders a preview of the message being replied to, resolving sender names and fetching missing messages if needed.",
  "frontend/src/components/DevPanel.tsx": "A developer-only panel showing auth info and allowing manual query refreshes.",
  "frontend/src/components/InfoPopups.tsx": "Renders two info popups triggered by buttons, using translations and shared popup layout.",
  "frontend/src/components/LanguageSwitcher.tsx": "Empty placeholder component.",
  "frontend/src/components/PopupBodySections.tsx": "Displays popup body content as a list of sections with optional headings and formatted text.",
  "frontend/src/components/ProfileCompletionGate.tsx": "Blocks app access until the user’s profile has a name, showing a form to save it if missing.",
  "frontend/src/components/QueryStateGate.tsx": "Wraps a query and handles loading, error, and success states before rendering children.",
  "frontend/src/components/RecordingFeedback.tsx": "Empty placeholder component.",
  "frontend/src/components/SharedPopup.tsx": "A shared dialog wrapper providing consistent sizing, scrolling, and trigger behavior for popups.",
  "frontend/src/components/ThemeToggle.tsx": "Button to toggle between light and dark themes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes related queries when it changes.",
  "frontend/src/hooks/useAudioRecording.ts": "Empty file.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Returns authentication status, principal string, and identity from Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, identity loading, and context provider using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, challenge data, recordings, and chat messages.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme preference with localStorage persistence and DOM updates.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Fetches the authenticated user's challenge status using the backend actor.",
  "frontend/src/i18n/i18n.ts": "Empty file.",
  "frontend/src/i18n/I18nContext.tsx": "Provides a translation context with a simple key-based lookup for English strings.",
  "frontend/src/i18n/index.ts": "Empty file.",
  "frontend/src/i18n/locales/en.json": "Empty translation file placeholder.",
  "frontend/src/i18n/locales/es.json": "Empty translation file placeholder.",
  "frontend/src/i18n/translations.ts": "Contains the full English translation dictionary for multiple app screens and UI text.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for light/dark themes and global layout settings.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Empty file.",
  "frontend/src/screens/Screen3Placeholder.tsx": "Placeholder UI for authenticated users without an active challenge, including refresh and navigation actions.",
  "frontend/src/screens/Screen4Placeholder.tsx": "Large placeholder screen handling challenge creation, management, invitations, participant actions, and start-time updates using many queries and UI components.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Empty file with no implementation provided.",
  "frontend/src/screens/Screen5Placeholder.tsx": "UI placeholder showing challenge state, info popups, and an optional edit button.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Main in‑challenge screen managing tabs, recordings, day selection, participant data, uploads, and challenge recovery.",
  "frontend/src/screens/UnifiedEntryMenu.tsx": "Entry menu that determines login behavior and routes users to create, manage, or join challenges.",
  "frontend/src/utils/appUrlState.ts": "Utilities for reading, writing, and clearing screen/navigation state via URL search parameters.",
  "frontend/src/utils/assignments.ts": "Defines fixed assignment metadata and content for the 7‑day challenge.",
  "frontend/src/utils/challengeContext.ts": "SessionStorage helpers for persisting and retrieving the active challenge ID.",
  "frontend/src/utils/challengeDayFormat.ts": "Formats challenge day headers using start time and day index into human‑readable strings.",
  "frontend/src/utils/challengeDeletedNotice.ts": "SessionStorage helpers for storing and clearing a challenge‑deleted notification flag.",
  "frontend/src/utils/challengeRecovery.ts": "Resets all client-side challenge state by clearing persisted IDs, URL state, and invalidating/removing related React Query caches.",
  "frontend/src/utils/invitationCodes.ts": "Generates random uppercase alphanumeric invitation codes using a restricted, unambiguous character set.",
  "frontend/src/utils/invitationLinks.ts": "Builds, parses, clears, and persists challenge invitation links and parameters using URL and sessionStorage.",
  "frontend/src/utils/recordingDayIndex.ts": "Converts day numbers between UI (1–7) and backend (0–6) formats with clamping.",
  "frontend/src/utils/recordingIds.ts": "Normalizes recording day and assignment IDs, mapping legacy assignment IDs to canonical ones and validating identifiers.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Sanitizes error messages, blocking unwanted backend messages and mapping known errors to friendly UI text.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters across query and hash routing using sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Defines overall project state, describing updated app scope and a list of existing implemented features with their descriptions, versions, and identifiers."
}