{
  "backend/main.mo": "Motoko canister implementing user profiles, challenge creation and participation, access control, and blob-based recording storage with authorization checks throughout. Manages challenges, invitation codes, and per-user recordings using maps and sets.",
  "feature_evidence.json": "Machine-readable report mapping specific frontend recording-feedback features to source files, dependencies, test IDs, and confidence levels for build and verification planning.",
  "frontend-file-summaries.txt": "Prewritten summary index describing the purpose and responsibilities of major frontend files, hooks, components, screens, and i18n assets.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH color tokens, light/dark theme variables, and base styles with RTL-aware layout support.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component handling authentication-aware screen routing between challenge states (screens 1–6) and coordinating query, navigation, and layout providers.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper that centers the app in a card-like container and positions the language switcher based on text direction.",
  "frontend/src/components/AuthButton.tsx": "Authentication control integrating Internet Identity with login/logout states, translated labels, and React Query cache reset on logout.",
  "frontend/src/components/DevPanel.tsx": "Developer-only diagnostic panel showing authentication state, principal ID, and controls to refresh backend-derived challenge status.",
  "frontend/src/components/InfoPopups.tsx": "Renders two info dialogs with scrollable, translated content explaining social contemplation and the challenge. Uses reusable dialog, button, and scroll UI components with i18n support.",
  "frontend/src/components/LanguageSwitcher.tsx": "Provides a dropdown menu to switch application language using available translations. Integrates with i18n context and adapts alignment for RTL languages.",
  "frontend/src/components/QueryStateGate.tsx": "Generic wrapper component that handles loading, error, and success states for React Query queries. Displays spinners, sanitized error messages, and a retry button before rendering children.",
  "frontend/src/components/RecordingFeedback.tsx": "Displays live audio recording feedback including REC indicator, timer, audio level meter, and reassurance text. Supports RTL layouts and animates visuals based on audio level.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on the current Internet Identity using React Query. Reinitializes access control and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useAudioRecording.ts": "Hook that manages microphone recording with MediaRecorder and Web Audio APIs, providing start/stop controls, audio level monitoring, elapsed time, and recorded audio blob. Handles cleanup of streams, timers, and audio contexts.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Lightweight hook that derives authentication state and principal string from the Internet Identity context. Exposes whether the user is authenticated along with identity details.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider using Dfinity AuthClient to manage login, logout, identity persistence, and login status. Exposes hooks and state for authentication lifecycle across the app.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks for fetching and mutating user profiles, challenge status, active challenge IDs, and related challenge actions, all gated by actor availability and authentication. Includes logic to resolve the active challenge ID from creator, participant, or persisted session state.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Provides a single React Query hook to fetch the authenticated user's challenge status from the backend actor with retry and caching configuration.",
  "frontend/src/i18n/i18n.ts": "Empty placeholder file, likely reserved for future i18n initialization or configuration logic.",
  "frontend/src/i18n/I18nContext.tsx": "Implements an internationalization context with language selection, persistent storage, RTL/LTR handling, and a translation lookup helper. Exposes an I18nProvider and useTranslation hook for accessing translations and language state.",
  "frontend/src/i18n/index.ts": "Empty barrel file intended to re-export i18n-related modules.",
  "frontend/src/i18n/locales/en.json": "Empty English locale JSON file, presumably intended to store English translation strings.",
  "frontend/src/i18n/locales/es.json": "Empty Spanish locale JSON file, presumably intended to store Spanish translation strings.",
  "frontend/src/i18n/translations.ts": "Defines the in-memory translation dictionary for multiple languages and documents supported languages and RTL handling. Contains structured translation keys used throughout the UI.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, base styles, and RTL-aware layout utilities.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wiring up React Query, Internet Identity authentication, and global styles.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Landing screen placeholder that displays the app title, tagline, feature highlights, authentication CTA, and footer using translated strings.",
  "frontend/src/screens/Screen3Placeholder.tsx": "Placeholder screen for authenticated users without an active challenge, supporting joining a challenge via invitation codes, URL/session persistence, and state refresh through React Query.",
  "frontend/src/screens/Screen4Placeholder.tsx": "Implements the challenge creation and management screen, handling start date selection, invitation code generation/copying, participant listing, and creator-only actions like removing participants or deleting the challenge via query hooks.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Provides a management view for an active challenge where users can see participants, refresh data, and leave the challenge, with recovery UI if no challenge context is found.",
  "frontend/src/screens/Screen5Placeholder.tsx": "A lightweight placeholder UI for the manage challenge screen showing static challenge state info, navigation to edit settings, and informational popups.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Main in-challenge experience for the 7-day challenge, allowing users to select days and assignments, record/play/delete audio reflections, view participant profiles, and navigate challenge progress.",
  "frontend/src/utils/assignments.ts": "Defines the fixed set of five daily assignments used across all seven challenge days, including titles and detailed reflection instructions.",
  "frontend/src/utils/challengeContext.ts": "Utility for persisting, retrieving, and clearing the active challenge ID in sessionStorage to restore challenge context after refresh.",
  "frontend/src/utils/challengeDayFormat.ts": "Formats a challenge day header string by computing the calendar date and weekday from a start time bigint and day index.",
  "frontend/src/utils/invitationCodes.ts": "Generates random, user-friendly uppercase alphanumeric invitation codes of configurable length.",
  "frontend/src/utils/invitationLinks.ts": "Builds, parses, and clears shareable invitation URLs containing challenge ID and invitation code query parameters.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Defines a shared utility to normalize unknown error inputs into safe, user-friendly messages by blocking a bogus migration message and mapping common backend recording errors to clearer UI text.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters from query strings or hash routes, persist them in sessionStorage, retrieve or clear them, and safely manage sensitive params across navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode, content scanning paths, design tokens based on CSS variables, extended animations and components, and includes typography, container queries, and animation plugins.",
  "project_state.json": "Stores a versioned snapshot of the overall project state, including a high-level summary of the Social Contemplation dapp and a structured list of existing backend and frontend features with IDs and descriptions."
}