{
  "backend/main.mo": "Main canister actor defining user profiles, challenges, chat, recordings, authorization, and various query/update endpoints with embedded state modules.",
  "feature_evidence.json": "JSON report mapping feature requirements to impacted frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all major frontend files in the project.",
  "frontend/index.css": "Forwarder stylesheet that imports the authoritative CSS from src/index.css.",
  "frontend/index.html": "Base HTML template setting caching rules, build-version metadata, and mounting the React app entry point.",
  "frontend/src/App.tsx": "Main React app controller handling auth gating, invitation restore, URL‑synced navigation, challenge deletion notices, and update‑guard behavior.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing centered mobile container and suppressing the migration banner.",
  "frontend/src/components/AppUpdatingNotice.tsx": "Full‑screen overlay showing a loading indicator when a version mismatch triggers an app update.",
  "frontend/src/components/AssignmentDetailText.tsx": "Renders assignment text with bold step headings by parsing lines and styling Step X prefixes.",
  "frontend/src/components/AudioRecorder.tsx": "Recording UI component using useAudioRecording to manage record/stop/review/upload flows with a live level meter and error handling.",
  "frontend/src/components/AuthButton.tsx": "Login/logout button integrating Internet Identity with translated status text and query‑cache clearing.",
  "frontend/src/components/AuthIconButton.tsx": "Icon-only auth button that triggers Internet Identity login/logout and clears React Query cache on logout.",
  "frontend/src/components/AutoInvitationRedeemGate.tsx": "Automatically redeems stored invitation codes when conditions allow and shows loading/error UI during the process.",
  "frontend/src/components/ChallengeChatTab.tsx": "Challenge chat UI supporting sending, editing, replying, and loading messages with auto-scroll and participant name resolution.",
  "frontend/src/components/ChallengeDeletedNotice.tsx": "Modal alert informing users a challenge was deleted and allowing them to dismiss the notice.",
  "frontend/src/components/ChatReplyReference.tsx": "Displays a referenced chat message preview with sender name using cached or fetched message data.",
  "frontend/src/components/DevPanel.tsx": "Developer debugging panel showing auth state and providing cache refresh utilities.",
  "frontend/src/components/InfoPopups.tsx": "Renders two informational popups triggered by buttons, using translated text content.",
  "frontend/src/components/LanguageSwitcher.tsx": "Empty placeholder component.",
  "frontend/src/components/PopupBodySections.tsx": "Renders popup sections with optional headings and formatted text.",
  "frontend/src/components/ProfileCompletionGate.tsx": "Blocks app until user profile is loaded and name is completed, showing a form when required.",
  "frontend/src/components/QueryStateGate.tsx": "Wrapper that handles query loading and error states before rendering children with data.",
  "frontend/src/components/RecordingFeedback.tsx": "Empty placeholder component.",
  "frontend/src/components/RecordingLevelMeter.tsx": "Displays a colored audio level bar based on a normalized input level with percentage text.",
  "frontend/src/components/RecordingPlayer.tsx": "Implements an audio player with play/pause controls, a seek slider, and time display using an HTMLAudioElement.",
  "frontend/src/components/RecordingWaveform.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/SharedPopup.tsx": "Provides a reusable dialog wrapper with consistent styling, scrolling, and trigger handling using shadcn UI primitives.",
  "frontend/src/components/ThemeToggle.tsx": "Renders a button that switches between light and dark themes using a custom theme hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the authenticated identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAppUpdateGuard.ts": "Checks app version on startup and triggers a one-time forced refresh when a mismatch is detected.",
  "frontend/src/hooks/useAudioRecording.ts": "Manages microphone recording, audio level analysis, timers, and cleanup while exposing controls and recording state.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Returns authentication status and principal derived from Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend data such as user profiles, recordings, challenges, and chat messages.",
  "frontend/src/hooks/useSuppressMigrationBanner.ts": "Hook that scans for and hides a specific recurring migration banner using a MutationObserver with limited-depth checks.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme preference with localStorage persistence and a toggle function.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Fetches the user's challenge status via react-query when authenticated and an actor is available.",
  "frontend/src/i18n/i18n.ts": "Empty placeholder file.",
  "frontend/src/i18n/I18nContext.tsx": "Provides translation context with simple nested-key lookup and forces English/LTR on mount.",
  "frontend/src/i18n/index.ts": "Empty placeholder file.",
  "frontend/src/i18n/locales/en.json": "Empty English locale placeholder.",
  "frontend/src/i18n/locales/es.json": "Empty Spanish locale placeholder.",
  "frontend/src/i18n/translations.ts": "Defines the full English translation dictionary covering app, auth, and screen UI text.",
  "frontend/src/index.css": "Tailwind base/styles and CSS variables for light/dark themes with global layout rules.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, Internet Identity, and global styles.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Empty placeholder screen component.",
  "frontend/src/screens/Screen3Placeholder.tsx": "Placeholder screen showing no-active-challenge UI, recovery actions, and create/join options.",
  "frontend/src/screens/Screen4Placeholder.tsx": "Large placeholder for creating or managing a challenge, including date setup, codes, participants, and mutations.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Empty placeholder file.",
  "frontend/src/screens/Screen5Placeholder.tsx": "Placeholder screen showing challenge overview text with optional edit navigation.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Main challenge screen handling day navigation, participant views, audio recording uploads, playback, and error recovery when a challenge is missing.",
  "frontend/src/screens/UnifiedEntryMenu.tsx": "Entry menu that decides whether users log in, start a challenge, or resume an active one, with UI for authentication and navigation.",
  "frontend/src/utils/appUrlState.ts": "Utility for reading, writing, and clearing navigation-related URL parameters without reloading the page.",
  "frontend/src/utils/appVersion.ts": "Functions to read and extract the app version from meta tags and HTML, rejecting placeholder values.",
  "frontend/src/utils/assignments.ts": "Defines the fixed set of daily challenge assignments with canonical IDs and detailed content.",
  "frontend/src/utils/backendBuildInfo.ts": "Caches backend build info in-memory and provides helpers to read, identify, and clear it.",
  "frontend/src/utils/challengeContext.ts": "Stores and retrieves the last active challenge ID in sessionStorage for persistence across refreshes.",
  "frontend/src/utils/challengeDayFormat.ts": "Formats day headers by computing dates from the challenge start time and day index.",
  "frontend/src/utils/challengeDeletedNotice.ts": "Persists and manages a session-based flag indicating the challenge was deleted.",
  "frontend/src/utils/challengeRecovery.ts": "Resets all client challenge state by clearing persisted data and invalidating related React Query caches.",
  "frontend/src/utils/hardRefresh.ts": "Provides a cache‑busted hard refresh with loop protection and a helper to clear the protection flag.",
  "frontend/src/utils/invitationCodes.ts": "Generates uppercase, non‑ambiguous invitation codes of configurable length.",
  "frontend/src/utils/invitationLinks.ts": "Builds, parses, clears, and persists challenge invitation parameters in URLs and sessionStorage.",
  "frontend/src/utils/recordingDayIndex.ts": "Converts and validates UI day values (1‑7) and backend day values (0‑6).",
  "frontend/src/utils/recordingDiagnostics.ts": "Logs sanitized recording upload attempts, failures, and successes with version context.",
  "frontend/src/utils/recordingIds.ts": "Defines canonical assignment IDs and utilities for normalizing days and validating assignment identifiers.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Extracts, classifies, and sanitizes backend errors into user‑friendly messages.",
  "frontend/src/utils/urlParams.ts": "Gets URL parameters (including hash routing), persists them in sessionStorage, and removes them safely.",
  "frontend/src/utils/versionCheck.ts": "Checks for app version mismatches by fetching fresh HTML and reports whether a refresh is needed.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, content scanning, extended color/theme settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state JSON describing requirements to add a live VU meter, remove waveform logic, and track related feature requests and issues."
}