{
  "backend/main.mo": "Main backend canister defining challenge, chat, recording, and user profile types, with authorization, blob storage, invite link integration, and build info queries.",
  "feature_evidence.json": "Feature evidence report mapping features to involved files, components, and test IDs with high-confidence verification metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of numerous frontend components, hooks, screens, and utilities.",
  "frontend/.gitignore": "Git ignore rules for dependencies, build outputs, environment files, IDE metadata, logs, and cache directories.",
  "frontend/DEPLOYMENT_VERIFICATION.md": "Checklist for confirming a successful deployment, verifying live app availability, and checking version stamping.",
  "frontend/index.css": "Thin CSS file forwarding to the main theme stylesheet in src.",
  "frontend/index.html": "HTML entry file including cache-busting headers and a build-stamped app-version meta tag for version tracking.",
  "frontend/scripts/generateAppVersion.mjs": "Build script generating a unique app version, writing it to .env.local and generating a TypeScript module for runtime use.",
  "frontend/src/App.tsx": "Root application component coordinating auth, challenge status, routing, version stamping, update guard, and optional DevPanel.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper with centered mobile container and migration banner suppression.",
  "frontend/src/components/AppUpdatingNotice.tsx": "UI overlay indicating the app is updating due to a detected version mismatch.",
  "frontend/src/components/AssignmentDetailText.tsx": "Component that renders multiline assignment text with bolded step labels and preserved spacing.",
  "frontend/src/components/AudioRecorder.tsx": "Renders a full audio recording UI with start/stop, playback, sharing dialog, upload handling, and error states.",
  "frontend/src/components/AuthButton.tsx": "Provides a login/logout button using Internet Identity with loading states and cache clearing.",
  "frontend/src/components/AuthIconButton.tsx": "Compact icon-only authentication control that triggers II login/logout and handles loading states.",
  "frontend/src/components/AutoInvitationRedeemGate.tsx": "Automatically redeems persisted invitation codes, shows loading/error states, and refreshes challenge queries.",
  "frontend/src/components/ChallengeChatTab.tsx": "Implements challenge chat with message list, sending, editing, replying, polling, and name resolution.",
  "frontend/src/components/ChallengeDeletedNotice.tsx": "Displays a dismissible alert dialog explaining that a challenge was deleted with scrollable content.",
  "frontend/src/components/ChatReplyReference.tsx": "Shows a compact reference preview for a replied-to chat message with sender name resolution.",
  "frontend/src/components/DevPanel.tsx": "Developer diagnostics panel showing auth info, version mismatch checks, and debugging tools.",
  "frontend/src/components/InfoPopups.tsx": "Renders two info popups using SharedPopup with translated titles, descriptions, and section content.",
  "frontend/src/components/LanguageSwitcher.tsx": "Empty file with no implementation.",
  "frontend/src/components/PopupBodySections.tsx": "Displays an array of sections with optional headings and formatted content inside popup bodies.",
  "frontend/src/components/ProfileCompletionGate.tsx": "Blocks children until the user profile has a name, showing a form to enter and save it.",
  "frontend/src/components/QueryStateGate.tsx": "Wrapper that shows loading or error UI for a query before rendering children with its data.",
  "frontend/src/components/RecordingFeedback.tsx": "Empty file with no implementation.",
  "frontend/src/components/RecordingLevelMeter.tsx": "Shows an audio level meter with color-coded bar and percentage display based on normalized input.",
  "frontend/src/components/RecordingPlayer.tsx": "Audio player with play/pause, time tracking, seeking slider, and formatted timestamps.",
  "frontend/src/components/RecordingWaveform.tsx": "Empty file with no implementation.",
  "frontend/src/components/SharedPopup.tsx": "Reusable dialog wrapper providing consistent layout, scrolling, and trigger behavior for popups.",
  "frontend/src/components/ThemeToggle.tsx": "Button that switches between light and dark themes using a custom hook.",
  "frontend/src/generated/appVersion.ts": "Exports a build version string using Vite env or a runtime-generated fallback when placeholders are detected.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and invalidates dependent queries on changes.",
  "frontend/src/hooks/useAppUpdateGuard.ts": "Checks app version on startup and triggers a one-time hard refresh when mismatched, with loop prevention.",
  "frontend/src/hooks/useAudioRecording.ts": "Hook handling microphone recording, audio analysis, timers, cleanup, and exposing recording controls and state.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Returns authentication status and principal string based on the Internet Identity hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication, handling login, stored identity loading, and exposing status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, challenge data, recordings, and chat messages via the backend actor.",
  "frontend/src/hooks/useSuppressMigrationBanner.ts": "Watches the DOM for an unwanted migration banner and hides detected elements using a MutationObserver.",
  "frontend/src/hooks/useTheme.ts": "Provides a light/dark theme hook that syncs with localStorage and applies the theme class to the document root.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Fetches the authenticated user's challenge status using React Query when an actor and authentication are available.",
  "frontend/src/i18n/i18n.ts": "Empty file placeholder.",
  "frontend/src/i18n/I18nContext.tsx": "Implements a simple i18n provider exposing a translation function using the English translation map.",
  "frontend/src/i18n/index.ts": "Empty file placeholder.",
  "frontend/src/i18n/locales/en.json": "Empty translation file placeholder for English.",
  "frontend/src/i18n/locales/es.json": "Empty translation file placeholder for Spanish.",
  "frontend/src/i18n/translations.ts": "Defines the full English translation dictionary for the app across multiple screens and UI sections.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables, base styles, and an About button glow effect.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Empty screen placeholder component.",
  "frontend/src/screens/Screen3Placeholder.tsx": "Displays a placeholder screen when no active challenge exists and offers navigation to create a challenge or refresh inconsistent state.",
  "frontend/src/screens/Screen4Placeholder.tsx": "Manages challenge creation and editing, including start dates, invitation codes, participant management, and challenge lifecycle actions.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Empty file with no implemented content.",
  "frontend/src/screens/Screen5Placeholder.tsx": "Shows a simple challenge overview with state info and an optional edit button.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Main in-challenge interface handling daily assignments, recordings, participant views, chat, and URL‑synced navigation state.",
  "frontend/src/screens/UnifiedEntryMenu.tsx": "Entry screen determining whether users should log in, create a challenge, or continue an active one, with theme and auth controls.",
  "frontend/src/utils/appUrlState.ts": "Utilities for reading, writing, and clearing app navigation state stored in URL parameters.",
  "frontend/src/utils/appVersion.ts": "Utilities for reading, validating, and stamping app version metadata, including fallback logic for placeholder versions.",
  "frontend/src/utils/assignments.ts": "Defines five fixed daily assignments for the challenge, each with canonical IDs, titles, and content.",
  "frontend/src/utils/backendBuildInfo.ts": "Caches and retrieves backend build info in the frontend and provides a short build identifier.",
  "frontend/src/utils/challengeContext.ts": "Persists, retrieves, and clears the active challenge ID in sessionStorage.",
  "frontend/src/utils/challengeDayFormat.ts": "Formats challenge day headers using start time and day index to produce readable date strings.",
  "frontend/src/utils/challengeDeletedNotice.ts": "Stores, checks, and clears a sessionStorage flag indicating a challenge-deleted notice should be shown.",
  "frontend/src/utils/challengeRecovery.ts": "Resets all client-side challenge state, clearing storage and invalidating related React Query caches.",
  "frontend/src/utils/hardRefresh.ts": "Performs a cache‑busted hard refresh with loop protection and provides utilities to attempt and reset it.",
  "frontend/src/utils/invitationCodes.ts": "Generates random uppercase alphanumeric invitation codes without ambiguous characters.",
  "frontend/src/utils/invitationLinks.ts": "Builds, parses, clears, and persists invitation link parameters while preserving navigation state.",
  "frontend/src/utils/recordingDayIndex.ts": "Converts and validates day numbers between UI (1–7) and backend (0–6) formats.",
  "frontend/src/utils/recordingDiagnostics.ts": "Logs recording upload attempts, failures, and successes with minimal diagnostic context.",
  "frontend/src/utils/recordingIds.ts": "Defines canonical assignment IDs and utilities to validate, assert, and normalize recording identifiers.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Provides helpers to extract, classify, and sanitize error messages into safe user-facing text.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from the hash.",
  "frontend/src/utils/versionCheck.ts": "Checks the running app version against the latest deployed version and indicates if a refresh is needed.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins.",
  "project_state.json": "Project state metadata describing deployment issues, existing features, and versioning requirements."
}