{
  "backend/main.mo": "Actor implementing challenge creation, user profiles, access control, recordings, chat, and invite link logic using multiple mixins and in-memory maps.",
  "backend/migration.mo": "Migration module that lowercases assignment keys inside nested recordings maps while preserving other challenge fields.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs for migration banner suppression and assignment canonicalization.",
  "frontend-file-summaries.txt": "Aggregated prewritten summaries describing key frontend files, components, hooks, screens, and i18n assets.",
  "frontend/index.css": "Imports and forwards the main global stylesheet from src/index.css.",
  "frontend/index.html": "Base HTML page loading the React app and specifying viewport and root mount container.",
  "frontend/src/App.tsx": "Main app controller handling auth state, URL-synced navigation, challenge status loading, invitation handling, and conditional screen rendering.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper component applying responsive container styling and invoking the migration banner suppression hook.",
  "frontend/src/components/AssignmentDetailText.tsx": "Renders multiline assignment text with bold 'Step X:' prefixes and preserved spacing.",
  "frontend/src/components/AuthButton.tsx": "Full-size authentication button handling Internet Identity login/logout with translated UI states and cache clearing.",
  "frontend/src/components/AuthIconButton.tsx": "Icon-only authentication control showing login/logout icons and executing Internet Identity auth flow with cache reset.",
  "frontend/src/components/AutoInvitationRedeemGate.tsx": "Automatically checks for stored invitation parameters and redeems them, showing loading, success, or error UI states. Invalidates related challenge queries after successful redemption.",
  "frontend/src/components/ChallengeChatTab.tsx": "Provides a full chat interface for challenges including message sending, editing, replying, auto‑scrolling, and participant name resolution. Fetches messages with polling when active.",
  "frontend/src/components/ChallengeDeletedNotice.tsx": "Displays a dismissible dialog informing users that a challenge was deleted. Uses translated text and a structured popup layout.",
  "frontend/src/components/ChatReplyReference.tsx": "Renders a compact reference preview for a replied‑to chat message, resolving sender names via cached or fetched data. Falls back to a loading placeholder if the message isn't available yet.",
  "frontend/src/components/DevPanel.tsx": "Developer‑only panel showing auth state and principal and offering a button to refresh challenge status queries. Not enabled by default.",
  "frontend/src/components/InfoPopups.tsx": "Renders two informational popups triggered by buttons, using translated content sections. Uses SharedPopup for consistent dialog behavior.",
  "frontend/src/components/LanguageSwitcher.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/PopupBodySections.tsx": "Renders a list of popup content sections with optional headings and pre‑wrapped text. Used for structured informational dialogs.",
  "frontend/src/components/ProfileCompletionGate.tsx": "Blocks app content until the user provides a profile name, showing a form and saving via mutation. Loads existing profile data and handles validation and errors.",
  "frontend/src/components/QueryStateGate.tsx": "Wraps a query and displays loading or error states with retry, rendering children only when data is ready. Standardizes UI for query‑dependent components.",
  "frontend/src/components/RecordingFeedback.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/SharedPopup.tsx": "Consistent dialog wrapper that composes shadcn Dialog primitives with scrolling content and triggers. Standardizes popup size and behavior across the app.",
  "frontend/src/components/ThemeToggle.tsx": "Toggles light and dark themes using a button that switches icons based on current theme. Relies on a custom useTheme hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAudioRecording.ts": "Empty file.",
  "frontend/src/hooks/useAuthPrincipal.ts": "Derives authentication state and principal string from the Internet Identity hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling identity loading, login, logout, and related status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query keys and hooks for fetching and mutating user profiles, challenge data, recordings, and chat messages using the actor.",
  "frontend/src/hooks/useSuppressMigrationBanner.ts": "Hides a specific migration banner in the DOM and suppresses reappearances using a MutationObserver.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme preference with localStorage and system fallback, providing a toggle function.",
  "frontend/src/hooks/useUserChallengeStatus.ts": "Fetches the authenticated user's challenge status using the actor, with caching and retry behavior.",
  "frontend/src/i18n/i18n.ts": "Empty file.",
  "frontend/src/i18n/I18nContext.tsx": "Implements a simple i18n provider with English translations and a lookup helper.",
  "frontend/src/i18n/index.ts": "Empty file.",
  "frontend/src/i18n/locales/en.json": "Empty file.",
  "frontend/src/i18n/locales/es.json": "Empty file.",
  "frontend/src/i18n/translations.ts": "Contains the English translation dictionary with nested sections for app text and UI strings.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light/dark themes, plus global resets and layout settings.",
  "frontend/src/main.tsx": "Initializes React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/screens/Screen1Placeholder.tsx": "Empty file.",
  "frontend/src/screens/Screen3Placeholder.tsx": "Placeholder screen showing no active challenge, recovery UI, and navigation to create a new challenge.",
  "frontend/src/screens/Screen4Placeholder.tsx": "Challenge creation and management placeholder handling dates, invitations, participants, and challenge lifecycle actions.",
  "frontend/src/screens/Screen5ManageChallenge.tsx": "Empty file with no implemented content.",
  "frontend/src/screens/Screen5Placeholder.tsx": "Simple placeholder showing challenge state info with optional navigation to edit mode.",
  "frontend/src/screens/Screen6InChallenge.tsx": "Main in‑challenge screen handling assignments, recordings, tabs, participants, and challenge state recovery.",
  "frontend/src/screens/UnifiedEntryMenu.tsx": "Entry menu determining login and navigation flow based on authentication and challenge status.",
  "frontend/src/utils/appUrlState.ts": "Utility for reading, writing, and clearing app state parameters in the URL without reloading.",
  "frontend/src/utils/assignments.ts": "Defines the fixed 7‑day challenge assignments with canonical IDs and detailed content.",
  "frontend/src/utils/challengeContext.ts": "Stores, retrieves, and clears the active challenge ID in sessionStorage.",
  "frontend/src/utils/challengeDayFormat.ts": "Formats a challenge day into a readable header using start time and day index.",
  "frontend/src/utils/challengeDeletedNotice.ts": "Manages a sessionStorage flag indicating a challenge-deleted notice should be shown.",
  "frontend/src/utils/challengeRecovery.ts": "Resets all challenge-related client state and invalidates relevant React Query caches.",
  "frontend/src/utils/invitationCodes.ts": "Generates random uppercase invitation codes without ambiguous characters.",
  "frontend/src/utils/invitationLinks.ts": "Builds, parses, persists, and clears challenge invitation link parameters in URL and sessionStorage.",
  "frontend/src/utils/recordingDayIndex.ts": "Converts and validates day indices between UI (1–7) and backend (0–6) formats.",
  "frontend/src/utils/recordingIds.ts": "Normalizes recording day and assignment IDs to backend canonical forms and validates them.",
  "frontend/src/utils/sanitizeErrorMessage.ts": "Extracts, interprets, and maps backend errors to user‑friendly messages.",
  "frontend/src/utils/urlParams.ts": "Retrieves, stores, persists, and clears URL parameters from query strings or hash routing.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom color system via CSS variables, extended animations, and plugins for typography, container queries, and animation.",
  "project_state.json": "Project metadata describing schema versions, dapp summary, and a detailed list of implemented features with IDs, descriptions, and versions."
}