{
  "kind": "build_request",
  "title": "Fix Manage Challenge: add Save-to-create flow and hide invites until saved",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Implement a working Manage Challenge screen flow where a challenge is only created/saved via an explicit **Save** action under the start-date section, and invitations are only available after a successful save.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "onder de startdatum instellen, met daaronder het uitnodigen van mensen.",
          "Uitnodigingscodes zijn na de save, en zijn zelfstandig aan te maken",
          "Daarom dacht ik aan een 'save' knop, dan wordt er een challenge gemaakt."
        ]
      },
      "acceptanceCriteria": [
        "On Manage Challenge, the Start Date card contains a primary button labeled exactly \"Save\" (English UI text).",
        "If the user has no active challenge, clicking \"Save\" creates a new challenge using the selected start date.",
        "If the user already has a managed challenge and is the creator, clicking \"Save\" updates the challenge start date (respecting the existing Day-1 backend restriction).",
        "The Invitations section is hidden until the save action succeeds (i.e., until there is a confirmed active challenge ID).",
        "The Participants section is hidden until a challenge exists (post-save)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Fix incorrect 'managed challenge' state when a stale/persisted challengeId exists but no real challenge exists in the backend, so the UI does not get stuck showing Participants with no way to create/save.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "ik kan geen challenge aanmaken en ik kan geen codes aanmaken. ik zie wel een veld met participants, maar weer geen plek om op te slaan"
        ]
      },
      "acceptanceCriteria": [
        "If any Manage Challenge query/mutation returns a backend error equivalent to \"Challenge not found\" for the currently resolved challengeId, the app clears the persisted active challenge context (sessionStorage) and re-renders Manage Challenge in 'create new challenge' mode.",
        "In 'create new challenge' mode, the UI shows Start Date + Save, and does not show Invitations or Participants."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Ensure there is a clear, working 'Create challenge' entry point that opens Manage Challenge in create mode (no challenge created until Save).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Ik mis ook een knop create challenge. Althans, die knop brengt mij naar dit menu, maar uiteindelijk kan ik het in het menu niet aanmaken, alleen instellen."
        ]
      },
      "acceptanceCriteria": [
        "From the 'no active challenge' experience, the user can navigate to Manage Challenge in create mode.",
        "Navigating to Manage Challenge in create mode does not create a challenge automatically; only the Save button does."
      ]
    }
  ],
  "constraints": [
    "Do not modify files in frontend/src/components/ui (shadcn components must be composed, not edited).",
    "Do not edit any frontend paths listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Respect the single-actor backend architecture (all Motoko logic remains in backend/main.mo)."
  ],
  "nonGoals": [
    "Do not change the invitation model from single-use invitation URLs (no new 'raw code only' sharing flow).",
    "Do not add new authentication providers (Internet Identity only).",
    "Do not redesign the in-challenge (Screen 6) recording experience as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}