{
  "kind": "build_request",
  "title": "Step 9 Polish: URL-based subview restoration, unified popups, and responsive consistency",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement explicit URL tokens so that refreshing the page restores the exact current screen and subview state (including Screen 6 tab selection and its key subview selections) rather than falling back to default in-memory navigation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Ensure routing works flawlessly across refreshes",
          "introduce explicit URL tokens so refresh restores the exact tab/subview?"
        ]
      },
      "acceptanceCriteria": [
        "When the user is on Screen 6 and refreshes, the app returns to Screen 6 (not Screen 5/3) if challenge status still permits it.",
        "When the user selects a Screen 6 tab (My/Team/Coming Soon) and refreshes, the same tab remains selected after reload.",
        "When the user changes key subview selections on Screen 6 (e.g., selected day; in Team tab, selected participant and participant day), those selections are preserved across refresh via URL tokens.",
        "URL token updates do not require a full page reload (use history replace/push), and do not break existing invitation-link parsing behavior."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Refactor popup/dialog usage to a single shared popup abstraction so popups behave identically across the app (consistent sizing, scroll behavior, close behavior, focus behavior, and RTL alignment), and update existing popup usages to use it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Ensure popups behave identically everywhere",
          "a single unified popup component with consistent behavior"
        ]
      },
      "acceptanceCriteria": [
        "Info popups rendered by the existing InfoPopups component behave identically on all screens where they appear (Screen 3 and Screen 5).",
        "Assignment detail popups on Screen 6 use the same shared popup abstraction and match the same interaction behavior (overlay click, ESC, close button placement, max width/height, ScrollArea behavior).",
        "No edits are made to shadcn component source files under frontend/src/components/ui; composition/wrapping is used instead."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Perform final responsive/mobile-first layout checks across mobile, tablet, and desktop, and adjust layout styles where needed so all primary screens (Screens 1, 3, 4, 5, 6) are readable and fully usable without overflow or clipped content at common breakpoints.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Final responsive checks",
          "mobile-first + tablet + desktop,  (but mobile first)"
        ]
      },
      "acceptanceCriteria": [
        "On small mobile widths, core actions remain visible and tappable (e.g., Screen 6 tabs, day selectors, record/play/delete controls).",
        "Dialogs/popups remain within viewport bounds and their content is scrollable rather than overflowing off-screen.",
        "On tablet/desktop widths, layouts do not appear stretched or awkward (content remains comfortably centered and spaced)."
      ]
    }
  ],
  "constraints": [
    "Do not introduce a full router framework; keep state-based navigation but synchronize it with URL tokens.",
    "Do not modify files under frontend/src/components/ui (read-only); implement shared popup behavior via wrapper/components that compose these primitives.",
    "Use English for any user-facing text introduced by these changes."
  ],
  "nonGoals": [
    "Backend API/schema changes.",
    "Adding new product features beyond URL subview restoration, popup consistency, and responsive polish.",
    "Changing Internet Identity authentication behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}