{
  "kind": "build_request",
  "title": "Add reliable live VU meter feedback during recording and remove waveform visualization",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the waveform visualization from the recording UI so users no longer see an empty/black waveform area while recording.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Input level vi meter is genoeg \nWaveform hoeft niet zichtbaar\nJa (de waveform kan dus weg)"
        ]
      },
      "acceptanceCriteria": [
        "When `isRecording` is true, the UI does not render `RecordingWaveform` (no canvas/placeholder waveform area is visible).",
        "No waveform is shown during recording or in the review state after recording.",
        "The rest of the record → stop → review → upload flow remains unchanged."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure a clearly visible, real-time input level (VU meter) is shown during recording and reliably updates in response to incoming microphone audio.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Dus dat je niet ziet dat er daadwerkelijk geluid binnenkomt als je opneemt.",
          "Of in ieder geval wil ik dat je een input level ziet, zodat je het gevoel hebt dat je dat eigenlijk opneemt."
        ]
      },
      "acceptanceCriteria": [
        "While recording, the `RecordingLevelMeter` is visible and updates multiple times per second as audio is detected (level changes are observable when speaking/clapping).",
        "On iOS/Safari and desktop browsers, the audio analysis starts successfully after the user taps “Start Recording” (e.g., AudioContext is resumed from a user gesture if needed).",
        "If microphone permission is denied or no microphone exists, an English error message is shown (existing error behavior preserved)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove waveform-related state/logic from the audio recording hook and component interfaces so the app no longer computes or stores waveform samples.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Waveform hoeft niet zichtbaar\nJa (de waveform kan dus weg)"
        ]
      },
      "acceptanceCriteria": [
        "`useAudioRecording` no longer exposes `waveformSamples` and does not update waveform sample arrays during `updateAudioLevel`.",
        "Any waveform-only components/props are removed from the active render path of the app (no unused waveform data is required by `AudioRecorder`).",
        "Recording still produces a playable `recordedBlob`/`recordedUrl`, and upload continues to work as before."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under `frontend/src/components/ui` or other paths listed in `frontend.immutablePaths`.",
    "Keep all existing recording, review, upload, and delete behaviors unchanged aside from removing the waveform visualization and improving the live level feedback."
  ],
  "nonGoals": [
    "Adding waveform visualization back (static or scrolling).",
    "Changing backend APIs, recording storage, or metadata formats.",
    "Introducing new recording features (pause, noise gate controls, device selection, etc.)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}