{
  "kind": "build_request",
  "title": "Fix production 'Invalid assignment' by adding legacy assignment ID fallback and robust client-side mapping",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a frontend compatibility layer that transparently maps assignment IDs between hyphenated and underscore variants when calling backend recording APIs, so production canisters that still validate legacy IDs do not reject requests.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In de draft mode werkt hij perfect, maar in de live app werkt hij niet goed.",
          "Invalid assignment: \"daily-check-in\"",
          "ik heb een schermafbeelding toegevoegd waar je de labels kan lezen, deze wil ik behouden."
        ]
      },
      "acceptanceCriteria": [
        "When the backend returns an error containing \"Invalid assignment:\" for any recording operation (save, share, get, delete, getAssignmentRecordings, getParticipantRecording), the frontend retries the same request once using the alternate ID format (daily-check-in <-> daily_check_in, morning-reflection <-> morning_reflection, evening-reflection <-> evening_reflection, mindfulness-practice <-> mindfulness_practice, gratitude-journal <-> gratitude_journal).",
        "If the retry succeeds, the UI proceeds as normal (no persistent error shown).",
        "If both attempts fail, the UI shows a single user-facing error message in English (no duplicate toasts/errors).",
        "Assignment labels/titles displayed in the UI remain unchanged from the current screenshots (e.g., the visible assignment cards still show the same labels the user provided)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the frontend always uses a single internal canonical assignment ID set for rendering and state (keep current IDs used in frontend), while persisting/reading recordings in React Query using a key strategy that prevents duplicate cache entries across the two backend ID variants.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "de assignmentnamen zijn een aantal keer veranderd.",
          "In de draft mode werkt hij perfect, maar in de live app werkt hij niet goed."
        ]
      },
      "acceptanceCriteria": [
        "UI components continue to reference one canonical assignment ID per assignment (no UI duplication caused by variant IDs).",
        "React Query cache keys for recording queries normalize assignment IDs so that a recording fetched via underscore variant is stored/read under the same cache entry as the hyphenated variant.",
        "Manual refresh and navigation between days/tabs does not re-trigger the invalid-assignment error once a successful retry has occurred."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add lightweight diagnostic logging (frontend-only) that captures the assignment ID used, the fallback attempt, and the sanitized backend error message whenever an invalid-assignment retry path is triggered, to make future production debugging easier.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In de live app krijg je een \"Invalid assignment: daily‑check‑in\" fout"
        ]
      },
      "acceptanceCriteria": [
        "When an invalid-assignment error occurs, the console logs clearly indicate (a) the original assignment ID, (b) the fallback ID used for retry, and (c) whether the retry succeeded.",
        "Logs do not include sensitive user data (no principals, no recording blob details)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit files listed as immutable in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if state changes require it (not expected for this fix).",
    "Use English for any user-facing text changes."
  ],
  "nonGoals": [
    "Renaming or changing the visible assignment labels/titles shown in the UI.",
    "Introducing a new backend database or external service to store assignment metadata.",
    "Adding real-time features or WebSocket-based synchronization."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}