{
  "kind": "build_request",
  "title": "Replace assignment + info popup copy and bold headings within the new text blocks",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the instructional text for the 5 fixed daily assignments (Awareness, Utopia, Small Steps, Support Strategies, Other Contemplations) with the exact new English copy provided by the user, fully replacing the existing assignment copy used in the in-challenge assignment detail popups.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ze zijn volledig te vervangen.",
          "Hier zijn alle teksten opnieuw. ... Daarom moeten de nieuwe teksten erin."
        ]
      },
      "acceptanceCriteria": [
        "Opening any assignment detail popup in the in-challenge screen shows the updated copy exactly matching the user-provided text for that assignment (including punctuation and the 1–3 minutes range).",
        "The Small Steps Step 1 text reads: \"Think of your current screen habits. Give yourself a rating from 0 to 10 that reflects how satisfied you are with your current screen behavior.\" (not the previous \"drawing\" wording).",
        "The Awareness Step 3 paragraph includes: \"Listen to your previous recordings and to those of others.\" (not \"and, if relevant, to those of others\")."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the assignment detail popup rendering so that within these assignment text blocks, the subheadings are bold: specifically, each \"Step 1:\", \"Step 2:\", and \"Step 3:\" line label must be rendered in bold while the step body text remains normal weight.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ik wil dat de titels van de teksten en de tussenkopjes bold zijn.",
          "Alleen in de nieuwe tekstblokken."
        ]
      },
      "acceptanceCriteria": [
        "In each assignment detail popup, the text \"Step 1: ...\", \"Step 2: ...\", and \"Step 3: ...\" headings are visually bold.",
        "Only the new assignment detail text blocks are affected; no global typography change is introduced for other screens/components."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Replace the content of the two info popups (Social Contemplation and About the challenge) with the exact new English copy provided by the user, fully replacing the existing popup copy, while keeping the existing popup structure (title/description + sectioned body).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ze zijn volledig te vervangen.",
          "Social Contemplation ... About the challenge ... (full text provided)"
        ]
      },
      "acceptanceCriteria": [
        "The Social Contemplation info popup includes the user-provided sections: \"What is social contemplation\", \"Solution-focused psychology\", and \"Making meaning together\", with their provided paragraphs.",
        "The About the challenge info popup includes the user-provided intro line \"Contemplate for about 15 to 30 minutes a day and let others inspire you\" plus Step 1/2/3 and Privacy & Security content exactly as provided, including the final sentence: \"If you end your participation in the challenge, all your data will be deleted\".",
        "Popup section headings in these info popups render bold (consistent with existing section heading styling)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under the immutable frontend paths listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Keep the change scoped to the new text blocks only; do not introduce app-wide heading/font-weight changes."
  ],
  "nonGoals": [
    "No backend schema or Motoko canister logic changes.",
    "No redesign of the popup system beyond updating copy and bolding headings/subheadings within the specified new text blocks.",
    "No language-switching or i18n feature expansion as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}