{
  "kind": "build_request",
  "title": "Fix audio recording Save → Share with team flow failing with “disallowed origin” in draft",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the audio recording upload + share flow so that clicking “Save” then confirming “Share with team? → Yes” successfully (1) uploads/saves the recording and (2) sets it as shared, making it visible on the Team tab for other participants, including when the app is opened from a Caffeine draft domain.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "als ik nu op save druk, en dan op share with group, yes, dan slaat hij niet op en dan deelt hij ook niet met de groep.",
          "ik zou op save drukken, dan komt pop up menu met de info van share with group en dan yes, en dan wordt de opname opgeslagene en gedeeld."
        ]
      },
      "acceptanceCriteria": [
        "From the in-challenge “My” tab, after recording audio, clicking “Save” opens the share confirmation dialog and clicking “Yes” completes without silently failing.",
        "After confirmation, the recording exists for the current assignment/day (My tab shows the saved/recorded state and playback works).",
        "After confirmation with “Yes”, the recording is visible to other participants via the Team tab (i.e., other participants can see a shared badge/indicator and can play it).",
        "The behavior works in the draft environment where the user currently sees “error disallowed origin” in the browser console."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update backend storage/upload origin validation (the cause of “error disallowed origin”) to allow the frontend origins used by Caffeine deployments so recording uploads are accepted from both draft and live app domains.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "(screenshots show 'error disallowed origin')"
        ]
      },
      "acceptanceCriteria": [
        "Recording uploads initiated from a Caffeine draft domain (e.g., https://*.caffeine.xyz) no longer fail due to origin checks.",
        "Recording uploads initiated from the live domain also continue to work.",
        "Origin-allowlisting remains explicit (do not disable origin validation globally)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve client-side error handling for recording save/share so users always get a clear English error message when an upload/share fails (including disallowed-origin failures), and the UI state resets appropriately (no stuck “Saving…” state).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "er gebeurt helemaal niets."
        ]
      },
      "acceptanceCriteria": [
        "If saving or sharing fails, the UI shows a user-facing English error message (not only a console error).",
        "If the failure reason contains “disallowed origin”, the displayed message explicitly indicates the app is running on an unauthorized domain/origin and that the user should use the official link or the deployment must be reconfigured.",
        "After a failure, the share dialog closes and the user can retry saving without refreshing the page."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if state schema changes are required.",
    "Do not edit any files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding new authentication providers beyond Internet Identity.",
    "Adding new recording features (e.g., editing, trimming, waveform rendering) beyond fixing save/share reliability and error messaging.",
    "Changing the challenge/assignment model unrelated to recording upload/sharing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}