{
  "kind": "build_request",
  "title": "Fix recording upload failures by aligning assignment IDs and day indexing (frontend 1–7 vs backend 0–6)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend recording validation to recognize the frontend assignment IDs (at minimum: \"awareness\" and \"utopia\", plus the other fixed assignments currently used by the frontend) so that recording save/get/delete operations no longer trap with \"Invalid assignment: awareness\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "bij  assignment-ID awareness bij de oefening awareness, maar kan ook bij andere assignments zoals utopia."
        ]
      },
      "acceptanceCriteria": [
        "Backend methods that validate assignment IDs for recordings accept the frontend assignment IDs used in frontend/src/utils/assignments.ts (including \"awareness\" and \"utopia\").",
        "Uploading a recording for assignmentId \"awareness\" no longer traps with \"Invalid assignment: awareness\"."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the day-index mismatch end-to-end so the app can use Day 1–7 in the UI while the backend can safely store/validate against its Day 0–6 model; ensure all recording-related operations (save/get/delete/getParticipantRecording/getAssignmentRecordings) consistently use the same normalized day index.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "neem de  tegelijk de dag‑mismatch (frontend 1–7 vs backend 0–6) mee"
        ]
      },
      "acceptanceCriteria": [
        "The UI continues to display and allow selecting days 1 through 7.",
        "Recording upload for Day 1 succeeds (backend receives/stores it under day 0 or otherwise validates without trapping).",
        "Recording upload for Day 7 succeeds (backend validates without trapping and stores under the correct final-day index).",
        "Fetching/playing and deleting recordings uses the same day normalization as saving, so a saved recording is retrievable and deletable from the same Day/Assignment selection."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make the backend tolerant to both legacy and current client inputs by normalizing (a) day values and (b) assignment IDs at the backend boundary before validation/storage, to reduce the risk of future mismatches causing traps.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "bij  assignment-ID awareness bij de oefening awareness, maar kan ook bij andere assignments zoals utopia.",
          "neem de  tegelijk de dag‑mismatch (frontend 1–7 vs backend 0–6) mee"
        ]
      },
      "acceptanceCriteria": [
        "Backend recording methods accept day input in either 0–6 or 1–7 form and handle it deterministically (normalize to a single internal representation).",
        "Backend assignment validation accepts the current frontend IDs without requiring frontend changes to assignment identifiers."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko architecture with all logic in backend/main.mo.",
    "Do not edit any frontend files under frontend/src/components/ui or any path listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Do not introduce new assignments or change assignment content beyond fixing ID compatibility.",
    "Do not redesign the UI/UX; only adjust logic needed to resolve assignment/day mismatches for recordings."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}