{
  "kind": "build_request",
  "title": "Add large live recording feedback UI (waveform/level meter + REC + timer) during audio capture",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a prominent in-recording focus UI in Screen 6 (My tab) that becomes visible while the user is actively recording an assignment, showing (1) a live animated waveform or level meter driven by microphone input, (2) a clear REC state indicator, (3) an elapsed timer, and (4) short reassuring microcopy that confirms recording is working.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "Ik wil bij het opnemen duidelijke feedback om te zien dat hij opneemt, bijvoorbeeld dat in de vorm van een waveform die ik kan zien.",
          "2: ja",
          "3: grotere focus‑component",
          "implementeer maar"
        ]
      },
      "acceptanceCriteria": [
        "When recording starts for an assignment, a large, visually dominant component appears in the recording area (not just a small icon change).",
        "The component animates in real time based on microphone input (waveform or level meter).",
        "The component shows a REC indicator and a timer that increments while recording is active.",
        "The component includes a short, reassuring line of text (English) indicating recording is in progress.",
        "The component layout renders correctly in both LTR and RTL modes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Extend the existing `useAudioRecording` hook to expose the minimal additional state needed for live feedback (e.g., current input level and elapsed recording seconds) using the Web Audio API (AnalyserNode) while recording, and ensure all media resources (tracks/audio context/analyser) are cleaned up on stop and on component unmount.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "je wilt tijdens het opnemen duidelijke, geruststellende feedback dat de opname echt loopt (bijv. een waveform of level‑meter).",
          "1: ja",
          "implementeer maar"
        ]
      },
      "acceptanceCriteria": [
        "`useAudioRecording` continues to return `recordedBlob`, `isRecording`, and existing controls, and additionally provides live feedback state usable by the UI (level and/or waveform data + elapsed time).",
        "While recording, the UI updates at a smooth cadence (e.g., animation frame or short interval) without blocking the main thread noticeably.",
        "Stopping a recording stops the live meter updates and releases microphone resources.",
        "Starting a new recording resets the timer and feedback visuals."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Integrate the new recording feedback UI into the existing Screen 6 recording flow so that it is tied to the currently-recording assignment (using the existing `recordingAssignment` state), does not interfere with saving/upload behavior, and does not require any backend changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Integratie in de bestaande opname‑flow (zonder backend‑wijzigingen nodig)"
        ]
      },
      "acceptanceCriteria": [
        "The feedback UI appears only for the assignment currently being recorded.",
        "Existing behavior remains unchanged: stopping triggers save/upload as it does today, and overwrite prevention remains intact.",
        "No backend interface changes are required to ship this feature."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Move any new user-facing strings introduced by the recording feedback UI (e.g., 'Recording…', 'Speak naturally', 'Tap Stop when done') into the i18n translation system and ensure English text is present for all newly referenced keys.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "No hard-coded new UI strings are added directly in Screen 6 or new components (except translation keys).",
        "English translations exist for all new keys and render correctly."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (compose existing shadcn components instead).",
    "Keep the backend as a single Motoko actor; do not introduce backend changes for this feature.",
    "Respect existing state-based navigation (no router) and existing Screen 6 save/delete/play flows."
  ],
  "nonGoals": [
    "Do not add comments, reactions, or chat features.",
    "Do not change challenge rules, invitation logic, or recording storage schema.",
    "Do not implement third-party audio visualization libraries; use built-in browser APIs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}