{
  "kind": "build_request",
  "title": "Step 1: Remove audio file upload UI and ensure the in-app audio recorder is active",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove (hide/disable) all UI elements that allow users to upload an existing audio file (e.g., file picker, \"Upload\" button meant for selecting a local file) anywhere in the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Voer stap 1 uit"
        ]
      },
      "acceptanceCriteria": [
        "There is no file-input based audio upload control visible anywhere in the UI.",
        "Users cannot select a local audio file for upload via the UI."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the in-app audio recorder flow is active and usable: users can start recording, stop recording, review the recorded audio, and proceed with the existing save/share action without exposing a user-facing control labeled \"Upload\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Voer stap 1 uit"
        ]
      },
      "acceptanceCriteria": [
        "On the in-challenge screen, users can start and stop a microphone recording successfully.",
        "After stopping, users can review playback of the recorded audio and then proceed with the action that sends it to the backend, but the control is not labeled \"Upload\" (use English UI text).",
        "No user-facing button labeled \"Upload\" is shown in the recorder UI."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not edit frontend immutable hook files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Do not implement the confirmation-before-sharing behavior in this step (that is a later step).",
    "Do not change backend Motoko logic or schemas for this step."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}