{
  "kind": "build_request",
  "title": "Fix audio upload 'Invalid assignment' errors and remove erroneous migration banner",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the audio upload failures that show backend errors like \"Invalid assignment\" for the 5 daily assignments by ensuring assignment identifiers are consistently canonicalized across all recording operations (save, get, list/team fetch, delete) and cannot diverge between frontend and backend.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "Ik heb net alle bij  5 de assignments een audio fragment geprobeerd te uploaden, maar het is niet gelukt",
          "fix maar"
        ]
      },
      "acceptanceCriteria": [
        "Uploading an audio file succeeds for each of the 5 assignments (awareness, utopia, small-steps, support-strategies, other-contemplations) on any valid day (1–7 in UI).",
        "After a successful upload, the recording is immediately visible in the \"My\" tab for that assignment/day and playable.",
        "The same uploaded recordings are visible and playable in the \"Team\" tab for other participants when selected.",
        "Deleting a recording succeeds for each of the 5 assignments and removes it from both \"My\" and \"Team\" views after refresh/refetch.",
        "No backend error containing \"Invalid assignment\" occurs for the canonical assignment IDs used by the UI."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove/stop the erroneous recurring UI status banner/message \"Migrating your project to the new structure. Hold tight — this is a one-time operation.\" so it does not appear during normal app usage when no migration is actually occurring.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Remove/stop the erroneous recurring UI status banner/message: “Migrating your project to the new structure. Hold tight — this is a one-time operation.”"
        ]
      },
      "acceptanceCriteria": [
        "The message \"Migrating your project to the new structure. Hold tight — this is a one-time operation.\" is not shown anywhere in the UI during normal navigation and use (including audio upload flows).",
        "No other loading/error UI is removed or degraded; genuine loading states still display appropriate messages (e.g., \"Loading...\")."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister; keep all logic in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui (compose them instead).",
    "Do not edit immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Do not add new authentication providers beyond Internet Identity.",
    "Do not introduce external databases or off-chain storage systems.",
    "Do not redesign unrelated screens or change challenge/chat behavior beyond what is required to fix assignment identifier consistency and remove the erroneous migration banner."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}