{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rebuild challenge recording audio flow in existing in-challenge screens (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Rebuild the in-challenge end-to-end recording flow (record → review → confirm share → upload/save → optional share toggle) and surface saved/shared recordings in existing My/Team tabs.",
      "acceptanceCriteria": [
        "From the in-challenge screen, a user can record audio for a selected day and assignment, confirm share choice, and complete an upload without silent failures.",
        "After a successful save, the recording is retrievable and playable in the UI.",
        "If the user chooses to share, the recording becomes visible to other challenge participants in the Team tab; if not shared, it remains private.",
        "Upload failures show a user-visible error message and do not result in a stuck UI state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Rework the recording flow wiring in the existing My/Team tabs: ensure assignment selection feeds AudioRecorder, saved recordings are fetched and playable, and a post-save share toggle is available for existing recordings. Use the blob-storage ExternalBlob capability (direct URLs + upload progress) already exposed via frontend/src/backend.d.ts; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AudioRecorder.tsx",
          "operation": "modify",
          "description": "Harden the UI state machine for record/review/save/share-confirm so it supports the rebuilt flow: keep review state until an explicit share decision, show progress, and display user-visible errors. Use existing shadcn/ui Dialog/Progress components already in this file; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure recording-related queries/mutations used by Screen6 reliably support the flow: refetch/invalidate the My and Team recording queries after save/share/delete so the UI reflects newly saved or shared recordings without requiring navigation changes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure My recording cards and upload handler always use canonical assignment IDs and consistent day conversion utilities, with robust progress + error handling.",
      "acceptanceCriteria": [
        "All frontend calls that save/share/delete/fetch recordings use only canonical assignment IDs from frontend/src/utils/recordingIds.ts (hyphenated IDs only).",
        "Day values sent to the backend are consistently converted using frontend/src/utils/recordingDayIndex.ts (UI 1–7 mapped to backend 0–6 if required by the backend).",
        "The upload progress indicator updates during blob upload and clears on success; errors are surfaced via existing error UI (e.g., sanitizeErrorMessage)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Update My-tab recording card wiring so all recording operations pass CanonicalAssignmentId values from the assignments source and never construct legacy/underscore IDs. Ensure day passed into hooks is always UI 1–7, relying on existing normalization in the recording hooks/utilities."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit and adjust recording hooks usage to consistently normalize UI day via frontend/src/utils/recordingDayIndex.ts and enforce canonical assignment IDs via frontend/src/utils/recordingIds.ts assertions for save/share/delete/fetch."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Make share confirmation trigger exactly one upload attempt, prevent bypass, and block duplicate submissions while uploading.",
      "acceptanceCriteria": [
        "Choosing 'Yes' or 'No' in the share dialog always results in a single upload attempt with the corresponding share choice.",
        "While uploading, record/save/share actions are disabled to prevent duplicate submissions.",
        "If the dialog is closed without a choice, no upload is triggered and the recording remains in review state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AudioRecorder.tsx",
          "operation": "modify",
          "description": "Add an internal one-shot guard for share decision clicks (e.g., disable Yes/No after the first click until the parent reports upload completion) and ensure closing the dialog without a decision does not call onUpload. Keep all new/edited user-facing text in English."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Add a defensive guard in the upload handler so if an upload is already in progress for the assignment/day, subsequent attempts are ignored and UI actions remain disabled until completion; continue surfacing errors via sanitizeErrorMessage and ensure upload state always clears on success/failure."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Rebuild/verify Team tab to show only shared recordings with clear empty states and reliable playback cleanup.",
      "acceptanceCriteria": [
        "The Team tab never shows private (not shared) recordings from other participants.",
        "When there are no shared recordings for a selected participant/day/assignment, the UI displays a clear 'no recordings yet' style state (English text).",
        "Playback of team recordings works reliably (start/stop/ended behavior does not leak audio objects)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Update Team tab to filter to isShared recordings only when rendering recordings returned from the backend, add explicit English empty states when no shared recordings exist for the selected participant/day/assignment, and ensure playback is managed without leaking audio objects (prefer reusing the existing RecordingPlayer component or a single controlled audio instance with proper cleanup)."
        },
        {
          "path": "frontend/src/components/RecordingPlayer.tsx",
          "operation": "modify",
          "description": "Verify and, if needed, strengthen audio element lifecycle management (create/revoke URLs, stop/pause on unmount, avoid accumulating listeners) so repeated Team playback does not leak audio resources."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Integrate the rebuilt audio flow without changing authentication, navigation structure, or account management behavior.",
      "acceptanceCriteria": [
        "No changes are made to Internet Identity integration hooks/components (immutable auth hook paths remain untouched).",
        "No changes are made to the app's top-level routing/navigation patterns; the rebuilt audio flow appears in the same screens/places as before.",
        "User profile/account flows remain functional and unchanged from a user perspective."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Confine all integration work for the rebuilt audio flow to the existing in-challenge screen and its child components, without altering top-level navigation/routing behavior or any immutable auth hook/component paths."
        },
        {
          "path": "frontend/src/components/AudioRecorder.tsx",
          "operation": "modify",
          "description": "Adjust only the recording/share-confirm UI logic for reliability, leaving authentication and navigation concerns untouched and keeping placement/usage within the existing in-challenge screen."
        }
      ]
    }
  ]
}