{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix recording assignment ID canonicalization and suppress erroneous migration banner",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure assignment identifiers are consistently canonicalized across all recording operations to prevent upload/playback/list/delete mismatches that trigger backend “Invalid assignment” errors.",
      "acceptanceCriteria": [
        "Uploading an audio file succeeds for each of the 5 assignments (awareness, utopia, small-steps, support-strategies, other-contemplations) on any valid day (1–7 in UI).",
        "After a successful upload, the recording is immediately visible in the \"My\" tab for that assignment/day and playable.",
        "The same uploaded recordings are visible and playable in the \"Team\" tab for other participants when selected.",
        "Deleting a recording succeeds for each of the 5 assignments and removes it from both \"My\" and \"Team\" views after refresh/refetch.",
        "No backend error containing \"Invalid assignment\" occurs for the canonical assignment IDs used by the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/recordingIds.ts",
          "operation": "modify",
          "description": "Harden assignment ID normalization so all recording operations use a single canonical form: trim, lowercase, and normalize common unicode dash variants and legacy separators (e.g., underscores/spaces) into the canonical IDs used by the UI. Add a safe normalization helper (e.g., tryNormalizeAssignmentId) to avoid runtime crashes and to make it impossible for non-canonical strings to reach recording calls."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure save/get/list(team fetch)/delete recording query hooks consistently derive the assignment argument and query keys from the same canonicalization utility (from recordingIds.ts). Where assignment normalization could fail, prevent the query/mutation from calling the backend and surface a controlled, user-safe error instead of throwing during render."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Plumb canonical assignment IDs through all recording-related UI actions (upload, play, delete, team playback) by typing assignment IDs to the canonical union type and normalizing any external inputs before invoking recording hooks. Ensure internal state keys (uploadStates, playingAssignment identifiers) cannot diverge from the canonical ID representation."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove/suppress the erroneous recurring migration status banner so it never appears during normal app usage while preserving genuine loading UI.",
      "acceptanceCriteria": [
        "The message \"Migrating your project to the new structure. Hold tight — this is a one-time operation.\" is not shown anywhere in the UI during normal navigation and use (including audio upload flows).",
        "No other loading/error UI is removed or degraded; genuine loading states still display appropriate messages (e.g., \"Loading...\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSuppressMigrationBanner.ts",
          "operation": "create",
          "description": "Create a small client-side suppression hook that, on mount, scans the DOM for elements containing the exact migration banner text and removes/hides them, and also installs a MutationObserver to catch and suppress re-insertions without impacting other UI."
        },
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Wire the suppression hook (useSuppressMigrationBanner) into the top-level shell so it runs across all screens and navigation states, while leaving existing app loading/error components untouched."
        }
      ]
    }
  ]
}