{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend fallback for legacy assignment ID variants + normalized React Query caching",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Retry recording API calls once with legacy (hyphen/underscore) assignment ID variant when backend rejects the provided assignment ID.",
      "acceptanceCriteria": [
        "When the backend returns an error containing \"Invalid assignment:\" for any recording operation (save, share, get, delete, getAssignmentRecordings, getParticipantRecording), the frontend retries the same request once using the alternate ID format (daily-check-in <-> daily_check_in, morning-reflection <-> morning_reflection, evening-reflection <-> evening_reflection, mindfulness-practice <-> mindfulness_practice, gratitude-journal <-> gratitude_journal).",
        "If the retry succeeds, the UI proceeds as normal (no persistent error shown).",
        "If both attempts fail, the UI shows a single user-facing error message in English (no duplicate toasts/errors).",
        "Assignment labels/titles displayed in the UI remain unchanged from the current screenshots (e.g., the visible assignment cards still show the same labels the user provided)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/assignmentIdCompat.ts",
          "operation": "create",
          "description": "Add a small compatibility utility that (1) maps between canonical hyphenated IDs and legacy underscore variants for the known assignments, (2) returns an alternate ID for retry, and (3) exposes helpers to detect an \"Invalid assignment:\" backend error and to normalize any variant to the canonical ID. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Wrap all recording-related backend calls (saveRecording, shareRecording, getRecording, deleteRecording, getAssignmentRecordings, getParticipantRecording) with a one-time retry on \"Invalid assignment:\" using the alternate ID from the compatibility utility, ensuring only one user-facing error is produced when both attempts fail. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Ensure upload/delete UI error handling continues to display a single English error message sourced from the final failure only (no duplicate error state updates), and that assignment titles/labels remain unchanged. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Keep canonical assignment IDs in UI/state while normalizing React Query cache keys so both backend ID variants share the same cache entry.",
      "acceptanceCriteria": [
        "UI components continue to reference one canonical assignment ID per assignment (no UI duplication caused by variant IDs).",
        "React Query cache keys for recording queries normalize assignment IDs so that a recording fetched via underscore variant is stored/read under the same cache entry as the hyphenated variant.",
        "Manual refresh and navigation between days/tabs does not re-trigger the invalid-assignment error once a successful retry has occurred."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Normalize assignment IDs used inside React Query keys for recording queries/mutations (recording, assignmentRecordings, participantRecording) by converting any variant to the canonical ID before key construction; ensure invalidation/removal uses the same normalized key strategy to prevent duplicate cache entries and to avoid re-triggering invalid-assignment after a successful fallback. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/recordingIds.ts",
          "operation": "modify",
          "description": "Add/adjust a minimal helper (or re-export from the compatibility utility) to support consistent canonicalization of assignment IDs for cache-key construction without changing the canonical IDs used by UI rendering. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add frontend-only diagnostic logs for invalid-assignment fallback attempts without exposing sensitive data.",
      "acceptanceCriteria": [
        "When an invalid-assignment error occurs, the console logs clearly indicate (a) the original assignment ID, (b) the fallback ID used for retry, and (c) whether the retry succeeded.",
        "Logs do not include sensitive user data (no principals, no recording blob details)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/recordingDiagnostics.ts",
          "operation": "modify",
          "description": "Add a lightweight logging helper dedicated to invalid-assignment fallback retries that logs only: operation name, original assignment ID, fallback assignment ID, sanitized backend error message (if present), and retry result (success/failure); explicitly avoid logging principals or blob details. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "When the invalid-assignment retry path is triggered for any recording operation, call the new diagnostic logger with original/fallback IDs, operation name, sanitized error message, and retry outcome; ensure logs are emitted only on this path. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}