{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Live in-recording feedback UI for Screen 6 audio capture",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a large, prominent in-recording focus UI in Screen 6 (My tab) with live meter, REC state, timer, and reassuring microcopy, rendering correctly in LTR/RTL.",
      "acceptanceCriteria": [
        "When recording starts for an assignment, a large, visually dominant component appears in the recording area (not just a small icon change).",
        "The component animates in real time based on microphone input (waveform or level meter).",
        "The component shows a REC indicator and a timer that increments while recording is active.",
        "The component includes a short, reassuring line of text (English) indicating recording is in progress.",
        "The component layout renders correctly in both LTR and RTL modes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RecordingFeedback.tsx",
          "operation": "create",
          "description": "Create a reusable RecordingFeedback UI component that renders a visually dominant in-recording panel (live animated level meter driven by mic input, REC indicator, elapsed timer, and short reassuring microcopy) and supports correct layout in both LTR and RTL directions."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Render the new RecordingFeedback component inside the My-tab assignment recording area, visible only when the assignment is actively recording; pass live feedback state (level/timer) and direction-aware layout props so the component is prominent and RTL-safe."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Extend useAudioRecording to expose minimal live-feedback state (input level and elapsed seconds) using Web Audio API AnalyserNode, with smooth updates and complete cleanup on stop/unmount.",
      "acceptanceCriteria": [
        "`useAudioRecording` continues to return `recordedBlob`, `isRecording`, and existing controls, and additionally provides live feedback state usable by the UI (level and/or waveform data + elapsed time).",
        "While recording, the UI updates at a smooth cadence (e.g., animation frame or short interval) without blocking the main thread noticeably.",
        "Stopping a recording stops the live meter updates and releases microphone resources.",
        "Starting a new recording resets the timer and feedback visuals."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAudioRecording.ts",
          "operation": "modify",
          "description": "Extend the hook to create and manage an AudioContext + AnalyserNode while recording, expose live feedback state (e.g., normalized input level and elapsedSeconds), update smoothly (e.g., requestAnimationFrame), reset feedback state on start, and ensure all resources (media tracks, audio context, analyser, animation/timer handles) are cleaned up on stop and on component unmount."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Integrate the feedback UI into Screen 6’s existing recording flow, tied to recordingAssignment, without altering save/upload behavior or requiring backend changes.",
      "acceptanceCriteria": [
        "The feedback UI appears only for the assignment currently being recorded.",
        "Existing behavior remains unchanged: stopping triggers save/upload as it does today, and overwrite prevention remains intact.",
        "No backend interface changes are required to ship this feature."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Tie RecordingFeedback visibility strictly to the current `recordingAssignment` and `isRecording` state; ensure stop/save side effects remain unchanged, the UI does not affect overwrite-prevention disabling logic, and no new backend calls or interface changes are introduced."
        },
        {
          "path": "frontend/src/components/RecordingFeedback.tsx",
          "operation": "modify",
          "description": "Ensure the component is purely presentational (no save/upload side effects), accepts live feedback state from the hook/screen, and can be mounted/unmounted safely as recordingAssignment changes."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Move newly introduced user-facing strings for recording feedback into i18n, ensuring English translations exist for all new keys.",
      "acceptanceCriteria": [
        "No hard-coded new UI strings are added directly in Screen 6 or new components (except translation keys).",
        "English translations exist for all new keys and render correctly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add new English i18n keys for the recording feedback UI (REC label, recording-in-progress microcopy, timer label/format helpers if needed) under the existing Screen 6 namespace so all new user-facing strings are sourced from translations."
        },
        {
          "path": "frontend/src/components/RecordingFeedback.tsx",
          "operation": "modify",
          "description": "Replace any user-facing strings in the new feedback UI with i18n translation keys via the existing translation context, ensuring English text is present for all newly referenced keys."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Ensure any newly added user-facing strings related to the recording feedback integration are referenced via i18n keys (no new hard-coded English strings introduced in Screen 6 for this feature)."
        }
      ]
    }
  ]
}