{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Redeploy verification and reliable frontend asset version stamping",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add frontend-side deployment verification guidance to ensure redeploy completes and the live app loads.",
      "acceptanceCriteria": [
        "A new deployment run completes successfully without errors.",
        "The live app loads (no persistent white screen/spinner) after the redeploy."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT_VERIFICATION.md",
          "operation": "create",
          "description": "Document a redeploy + validation checklist focused on confirming the live app loads and verifying the runtime version meta tag and compiled build version (including how to use ?dev=true to open the Developer Panel) to catch stale asset issues."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure production HTML is stamped with a concrete, unique build version and the runtime BUILD_VERSION is never a placeholder.",
      "acceptanceCriteria": [
        "In the live environment, `document.querySelector('meta[name=\"app-version\"]').getAttribute('content')` is non-empty and does not contain placeholder patterns (e.g., `$...`, `%VITE_...`, `BUILD_VERSION_PLACEHOLDER`, `VITE_BUILD_TIMESTAMP`).",
        "`frontend/src/generated/appVersion.ts` exports a `BUILD_VERSION` value that is concrete at runtime (never a placeholder string)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Stamp the `meta[name=\"app-version\"]` content at build time using Vite HTML env substitution (so the deployed HTML ships with a non-empty version value even before JS runs), while keeping existing runtime stamping as fallback."
        },
        {
          "path": "frontend/scripts/generateAppVersion.mjs",
          "operation": "modify",
          "description": "Harden the build-version generation flow so production builds reliably get a concrete unique `VITE_BUILD_TIMESTAMP` (e.g., write version to additional env files used by production builds, and ensure placeholder-like values cannot be emitted)."
        },
        {
          "path": "frontend/src/generated/appVersion.ts",
          "operation": "modify",
          "description": "Align placeholder detection / fallback behavior with the updated build stamping rules so `BUILD_VERSION` is always concrete at runtime (and never a placeholder string) even if env injection fails."
        },
        {
          "path": "frontend/src/utils/appVersion.ts",
          "operation": "modify",
          "description": "Update version parsing/validation helpers so placeholder patterns (e.g., `%VITE_...`, `$...`, `VITE_BUILD_TIMESTAMP`) are consistently treated as invalid for both DOM reads and HTML extraction, matching the acceptance criteria."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the Developer Panel accurately displays version diagnostics after redeploy for stale-asset troubleshooting.",
      "acceptanceCriteria": [
        "With `?dev=true`, the Developer Panel shows a non-empty “Running Version (meta tag)” value (or clearly indicates “(not set)” only if the meta tag truly cannot be stamped).",
        "With `?dev=true`, the Developer Panel shows the “Compiled Build Version” value and it matches the stamped meta-tag value when stamping is functioning."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DevPanel.tsx",
          "operation": "modify",
          "description": "Adjust the version diagnostics section to show (a) the raw meta-tag value, (b) the validated running version status, and (c) a clear comparison indicator vs `BUILD_VERSION`, so mismatches/placeholder stamping problems are obvious with ?dev=true."
        },
        {
          "path": "frontend/src/utils/appVersion.ts",
          "operation": "modify",
          "description": "Expose minimal additional helpers needed by DevPanel (e.g., read raw meta content and/or placeholder classification) so the panel can distinguish between missing, placeholder, and correctly stamped versions."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the startup stamping behavior remains compatible with build-time HTML stamping (i.e., only overwrite when the meta tag is missing/placeholder) to keep Running Version and Compiled Build Version aligned."
        }
      ]
    }
  ]
}