{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Align frontend recording day/assignment identifiers and ensure immediate UI updates after upload/delete",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Use a single canonical day (UI 1–7 => backend 0–6) and canonical assignment identifiers across all recording operations, with React Query cache updates so upload/delete state updates immediately.",
      "acceptanceCriteria": [
        "For the same selected UI day and assignment, the UI uses consistent parameters across save/get/delete calls (no mismatched day index or assignment id between operations).",
        "After upload succeeds, the assignment card shows the recorded state and disables upload until delete.",
        "After delete succeeds, the recorded state clears and upload is re-enabled for that slot without a manual refresh.",
        "User-facing error messages shown in the UI for recording operations remain in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/recordingIds.ts",
          "operation": "create",
          "description": "Add shared frontend-only normalizers for recording identifiers: (1) normalize UI day values to the backend canonical range 0–6 using the existing day conversion utility, and (2) normalize/validate assignment identifiers to the canonical IDs used by the app (awareness, utopia, small-steps, support-strategies, other-contemplations). This ensures every recording call path uses the same canonical identifiers."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update all recording-related React Query hooks (save/get/delete/getAssignmentRecordings/getParticipantRecording) to apply the shared canonical identifier normalization (day and assignment) before calling backend capabilities and before building query keys. Also, on successful delete, proactively clear/remove the cached recording query data (not just invalidate) so the UI does not keep showing stale 'Recorded' state if a refetch returns a not-found error."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Ensure the in-challenge UI passes canonical assignment IDs consistently to upload/get/delete/team playback flows (using the shared normalizer where appropriate) and surfaces delete failures to the user using existing English error sanitization. After a successful delete, ensure any per-assignment UI error state is cleared so upload is immediately re-enabled and the recorded badge/state disappears without a manual refresh."
        }
      ]
    }
  ]
}