{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Step 1: Remove audio file upload UI and keep in-app recorder active",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove/hide any UI that allows selecting an existing local audio file for upload anywhere in the app.",
      "acceptanceCriteria": [
        "There is no file-input based audio upload control visible anywhere in the UI.",
        "Users cannot select a local audio file for upload via the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AudioRecorder.tsx",
          "operation": "modify",
          "description": "Audit and remove any file-picker style audio upload controls (e.g., input type=\"file\", browse/select-file flows) if present; ensure this component only supports in-app microphone recording + review."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Audit the in-challenge screen to ensure it does not render (or conditionally render) any audio file upload UI (e.g., file picker / select-local-file controls), and that it only exposes the recorder-based flow for creating recordings."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the in-app audio recorder flow remains usable (start/stop/review/save-share) without any user-facing control labeled \"Upload\".",
      "acceptanceCriteria": [
        "On the in-challenge screen, users can start and stop a microphone recording successfully.",
        "After stopping, users can review playback of the recorded audio and then proceed with the action that sends it to the backend, but the control is not labeled \"Upload\" (use English UI text).",
        "No user-facing button labeled \"Upload\" is shown in the recorder UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AudioRecorder.tsx",
          "operation": "modify",
          "description": "Update recorder review/actions UI to remove/replace the \"Upload\" button label and related wording (e.g., change to \"Save\" / \"Send\" / \"Share\" and adjust loading text accordingly); keep start/stop, playback review, and trigger to send the recorded audio via the existing onUpload callback."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Ensure the in-challenge screen wiring continues to provide a complete recorder flow (start, stop, review, then send-to-backend action) while not exposing any user-facing control labeled \"Upload\"; if needed, pass a non-\"Upload\" label down to AudioRecorder via props."
        }
      ]
    }
  ]
}