{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Challenge-scoped recording share confirmation + shared-only Team tab rendering",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add a Yes/No confirmation modal to the recorder Save action to decide whether to share the new recording with the challenge team.",
      "acceptanceCriteria": [
        "Clicking Save in the recorder shows a modal with exactly two choices (Yes / No) and no additional required inputs.",
        "Choosing \"No\" results in the recording being available in the 'My' tab but not playable/visible in the 'Team' tab for other participants.",
        "Choosing \"Yes\" results in the recording being playable/visible in the 'Team' tab for other participants in the same challenge."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AudioRecorder.tsx",
          "operation": "modify",
          "description": "Change the Save flow to open a confirmation-only modal with exactly two actions (Yes / No) in English; on selection, call the provided save callback with the recorded blob plus the user’s share choice. Compose the modal using existing shadcn Dialog primitives (do not modify anything under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Update the recording save handler to accept a share decision from AudioRecorder; after saving, call the backend sharing capability (shareRecording) with isShared=true for \"Yes\" and isShared=false for \"No\"; ensure React Query invalidations refresh both My and Team data for that (challengeId, day, assignment)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook for the backend sharing capability (shareRecording) and wire it into existing recording cache invalidations so Team views reflect newly-shared recordings immediately."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update the Team tab to show and play only recordings that have been explicitly shared, browsable by participant, day, then assignment.",
      "acceptanceCriteria": [
        "In the Team tab, selecting a participant and day shows a list of exercises/assignments where only shared recordings are indicated as available.",
        "If a recording exists privately but was not shared, the Team tab must behave as if no recording exists for that slot.",
        "The Team tab does not attempt to call any backend method that returns private recordings for other participants."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Align the Team-facing query hook(s) to the backend interface for shared recording discovery: update the getAssignmentRecordings hook return typing to use Recording { value, isShared } (not ExternalBlob), and ensure query logic supports detecting availability without fetching private recordings."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Refactor the Team tab assignment list to determine availability using the assignment-level recordings query (grouped data), then only attempt audio playback when the selected participant has a Recording with isShared=true for the selected day+assignment. Remove/avoid per-assignment calls that directly fetch another participant’s recording when none is shared."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Ensure My-tab deletion updates UI state and triggers Team-tab refresh so deleted recordings are no longer shown/played as shared.",
      "acceptanceCriteria": [
        "After deleting a recording, other participants can no longer fetch/play it in the Team tab (it is no longer shared/available).",
        "The recording is also removed from the owner’s 'My' tab state after deletion."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the deleteRecording mutation invalidates/removes all relevant cached queries for both My and Team views (including any assignment-level shared-recording discovery queries) so the UI no longer indicates availability after deletion."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "After successful deletion from the My tab, ensure local UI state and play state are reconciled (e.g., stop playback if the deleted slot was playing) and rely on updated query invalidations so Team availability updates promptly."
        }
      ]
    }
  ]
}