{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend rebuild cache-busting via build-time app-version stamping",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure each rebuild produces a new app-version identifier that is reflected in the runtime HTML meta tag to prevent stale frontend caches.",
      "acceptanceCriteria": [
        "A new build is generated successfully.",
        "The generated build has a different app version identifier than the previous build (the HTML meta tag `app-version` is updated at build time).",
        "After publishing the new build to live, loading the live URL reflects the new build version (no stale bundle)."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/generateAppVersion.mjs",
          "operation": "modify",
          "description": "Extend the build-time version generator to also write a deterministic source file (e.g., frontend/src/generated/appVersion.ts exporting the generated version string) in addition to updating frontend/.env.local, so every rebuild changes a compiled artifact and provides a reliable version value for runtime stamping."
        },
        {
          "path": "frontend/src/generated/appVersion.ts",
          "operation": "create",
          "description": "Add a generated module that exports the current build's version identifier (to be overwritten by frontend/scripts/generateAppVersion.mjs during builds) so the app can display/stamp a concrete build version even if the HTML placeholder remains in some environments."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import the generated build version and, on app startup, stamp it into the document meta tag meta[name=\"app-version\"] (only when missing/placeholder) so the running version is always concrete for update-guard/version checks and for verifying cache-busting on live."
        },
        {
          "path": "frontend/src/utils/appVersion.ts",
          "operation": "modify",
          "description": "Harden placeholder detection and parsing so getRunningAppVersion/extractVersionFromHTML reliably treat unset/placeholder values as invalid and return the stamped build version once applied, ensuring version mismatch checks work predictably across rebuilds."
        }
      ]
    }
  ]
}