{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Repair recording Save→Share flow reliability and user-facing error handling (draft domains)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure Save→Share(Yes) reliably saves the audio and marks it shared so it appears for others in Team tab, including in draft domains.",
      "acceptanceCriteria": [
        "From the in-challenge “My” tab, after recording audio, clicking “Save” opens the share confirmation dialog and clicking “Yes” completes without silently failing.",
        "After confirmation, the recording exists for the current assignment/day (My tab shows the saved/recorded state and playback works).",
        "After confirmation with “Yes”, the recording is visible to other participants via the Team tab (i.e., other participants can see a shared badge/indicator and can play it).",
        "The behavior works in the draft environment where the user currently sees “error disallowed origin” in the browser console."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Harden the Save→Share sequence: treat save and share as separate steps with distinct failure handling (e.g., if save succeeds but share fails, keep the saved recording visible, invalidate relevant queries, and surface an actionable error prompting the user to retry sharing). Ensure React Query invalidations cover both My-tab recording state and Team-tab shared indicators, and ensure upload state always exits the “Saving…” state on any failure. Verify the component's usage instructions before implementing (blob-storage ExternalBlob upload/progress behaviors)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add clear English client-side error messages for save/share failures (including disallowed-origin) and reset UI state so users can retry without refresh.",
      "acceptanceCriteria": [
        "If saving or sharing fails, the UI shows a user-facing English error message (not only a console error).",
        "If the failure reason contains “disallowed origin”, the displayed message explicitly indicates the app is running on an unauthorized domain/origin and that the user should use the official link or the deployment must be reconfigured.",
        "After a failure, the share dialog closes and the user can retry saving without refreshing the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/sanitizeErrorMessage.ts",
          "operation": "modify",
          "description": "Add explicit sanitization/mapping for upload/share failures that include “disallowed origin” (and common variants), returning a clear English message explaining the app is running on an unauthorized origin/domain and that the user should use the official link or the deployment must be reconfigured. Keep other mappings intact and avoid exposing raw backend/storage error text."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Ensure UI state resets correctly on failures: always set per-assignment upload state to non-uploading, preserve the recorded blob so Save can be retried, and show the sanitized user-facing error text (including the disallowed-origin mapping). Ensure errors from either save or share are surfaced consistently."
        },
        {
          "path": "frontend/src/components/AudioRecorder.tsx",
          "operation": "modify",
          "description": "Guarantee the share confirmation dialog closes on any user decision and never leaves the UI in a stuck state; ensure error display prioritizes sanitized upload/share errors and that the user can immediately retry Save without refreshing. Verify the component's usage instructions before implementing (shadcn-ui Dialog behavior in this wrapper usage)."
        }
      ]
    }
  ]
}