{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Normalize recording day index at frontend/backend boundary (UI Day 1–7 vs backend Day 0–6)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Normalize day indexing for all recording save/get/delete flows so UI remains Day 1–7 while backend calls consistently use a single normalized day index.",
      "acceptanceCriteria": [
        "The UI continues to display and allow selecting days 1 through 7.",
        "Recording upload for Day 1 succeeds (backend receives/stores it under day 0 or otherwise validates without trapping).",
        "Recording upload for Day 7 succeeds (backend validates without trapping and stores under the correct final-day index).",
        "Fetching/playing and deleting recordings uses the same day normalization as saving, so a saved recording is retrievable and deletable from the same Day/Assignment selection."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/recordingDayIndex.ts",
          "operation": "create",
          "description": "Add a small utility that converts UI day selection (1–7) to the backend day model (0–6) deterministically (and optionally supports pass-through when already normalized) for use by all recording-related backend calls."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update all recording-related hooks (save/get/delete/getParticipantRecording/getAssignmentRecordings) to normalize the provided day value via frontend/src/utils/recordingDayIndex.ts before calling backend recording capabilities, and to use the normalized day value consistently in React Query keys/invalidation so save/get/delete align."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Ensure Screen6 continues to display/select days 1–7, while all recording interactions (upload, fetch/play, delete, participant recording fetches) pass the UI day to the updated hooks so normalization is applied consistently across My and Team tabs."
        }
      ]
    }
  ]
}