{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Step 9 Polish: URL-synced subviews, unified popups, and responsive consistency",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Synchronize screen + Screen 6 tab/subview selections to explicit URL tokens so refresh restores the exact in-app state without introducing a router framework.",
      "acceptanceCriteria": [
        "When the user is on Screen 6 and refreshes, the app returns to Screen 6 (not Screen 5/3) if challenge status still permits it.",
        "When the user selects a Screen 6 tab (My/Team/Coming Soon) and refreshes, the same tab remains selected after reload.",
        "When the user changes key subview selections on Screen 6 (e.g., selected day; in Team tab, selected participant and participant day), those selections are preserved across refresh via URL tokens.",
        "URL token updates do not require a full page reload (use history replace/push), and do not break existing invitation-link parsing behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/appUrlState.ts",
          "operation": "create",
          "description": "Add a small URL-token utility for reading/writing app navigation state (screen + Screen 6 subview tokens) via window.history.replaceState/pushState, merging with existing query params so invitation params (challengeId/code) remain intact until cleared."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Initialize and keep currentScreen synchronized with URL tokens using the new URL state utility (no router). On load/refresh, restore the URL-requested screen when allowed by authenticated challenge status/resolvedChallengeId; on in-app navigation, update URL tokens without reloading."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Make Screen 6 tab selection and key subview selections controlled (tab, selectedDay, selectedParticipant, selectedParticipantDay) and hydrate them from URL tokens on mount; update URL tokens on changes without full reload using the shared URL state utility."
        },
        {
          "path": "frontend/src/utils/invitationLinks.ts",
          "operation": "modify",
          "description": "Ensure invitation parsing/clearing remains compatible with additional app URL tokens by continuing to remove only challengeId/code parameters while preserving any other query params used for screen/subview restoration."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Unify all popup/dialog behavior behind a shared abstraction and migrate existing popups to it without editing shadcn/ui source files.",
      "acceptanceCriteria": [
        "Info popups rendered by the existing InfoPopups component behave identically on all screens where they appear (Screen 3 and Screen 5).",
        "Assignment detail popups on Screen 6 use the same shared popup abstraction and match the same interaction behavior (overlay click, ESC, close button placement, max width/height, ScrollArea behavior).",
        "No edits are made to shadcn component source files under frontend/src/components/ui; composition/wrapping is used instead."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SharedPopup.tsx",
          "operation": "create",
          "description": "Create a shared popup/dialog wrapper component that composes existing shadcn Dialog primitives to enforce consistent sizing, viewport-bounded max height, scroll behavior, close behavior (overlay/ESC/close button), focus behavior defaults, and RTL-aligned header/layout. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/InfoPopups.tsx",
          "operation": "modify",
          "description": "Refactor InfoPopups to use the new SharedPopup abstraction so both dialogs behave identically across Screen 3 and Screen 5 (consistent sizing, ScrollArea behavior, close behavior, and RTL alignment). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Replace the assignment details Dialog/ScrollArea usage with SharedPopup so Screen 6 assignment detail popups match the same interaction and sizing behavior as other popups across the app. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Polish responsive/mobile-first layouts across Screens 1, 3, 4, 5, 6 to prevent overflow/clipping and keep primary controls usable at common breakpoints.",
      "acceptanceCriteria": [
        "On small mobile widths, core actions remain visible and tappable (e.g., Screen 6 tabs, day selectors, record/play/delete controls).",
        "Dialogs/popups remain within viewport bounds and their content is scrollable rather than overflowing off-screen.",
        "On tablet/desktop widths, layouts do not appear stretched or awkward (content remains comfortably centered and spaced)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Adjust the shell container to be mobile-first while supporting tablet/desktop comfortably (responsive max-width), and ensure the app content can scroll within the viewport (avoid clipped content due to fixed min-heights/overflow-hidden)."
        },
        {
          "path": "frontend/src/screens/Screen6InChallenge.tsx",
          "operation": "modify",
          "description": "Tune Screen 6 small-width layout for tappability and no overflow (e.g., day selectors, recording controls, team recordings area) while keeping tablet/desktop spacing centered and not awkwardly stretched."
        },
        {
          "path": "frontend/src/components/SharedPopup.tsx",
          "operation": "modify",
          "description": "Ensure the shared popup abstraction is viewport-safe at mobile/tablet/desktop (max width/height constraints and internal scroll area behavior) so dialogs never overflow off-screen. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Apply minimal global responsive polish where necessary (e.g., safe scrolling behavior/viewport constraints) while preserving existing RTL-aware base styles and avoiding new global stylesheet entry points."
        }
      ]
    }
  ]
}