{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Update the assignment and audio recording flow: remove the upload button, support recording/delete in the audio recorder with confirmed sharing to team members, and restore/standardize assignment titles across UI including pop-up menus.",
  "architectural_notes": [
    "Sharing recorded audio with team members requires an explicit user confirmation step before becoming visible."
  ],
  "known_issues": [
    "Build engine may fail on large/combined prompts; changes may need to be submitted as smaller sequential steps."
  ],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-remove-hide-disable-all-ui-elements-that-allow-users-to-upload-an-existing-audio-file-e-g-file-picker-upload-button-meant-for-selecting-a-local-file-anywhere-in-the-app",
      "title": "Remove (hide/disable) all UI elements that allow users to upload an existing audio file (e.g., file picker, \"Upload\" button meant for selecting a local file) anywhere in the app.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-in-app-audio-recorder-flow-is-active-and-usable-users-can-start-recording-stop-recording-review-the-recorded-audio-and-proceed-with-the-existing-save-share-action-without-exposing-a-user-facing-control-labeled-upload",
      "title": "Ensure the in-app audio recorder flow is active and usable: users can start recording, stop recording, review the recorded audio, and proceed with the existing save/share action without exposing a user-facing control labeled \"Upload\".",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Remove the upload button everywhere (disable uploading existing audio files) and re-enable the audio recorder flow.",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-2",
      "summary": "Add confirmation step before sharing a recorded audio to team members; after confirmation the recording becomes visible to the team.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Ensure recordings can be recorded and deleted within the audio recorder.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Rename all assignments to: Awareness, Utopia, Small steps, Support strategie, Other contemplations, and ensure these names are used correctly in all pop-up menus.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "projectName": "Step 1: Remove audio file upload UI and ensure the in-app audio recorder is active",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}