{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Social Contemplation is an Internet Computer (ICP) dapp (Motoko canister backend + React/TypeScript frontend) for running a shared 7‑day “screen time challenge” with friends. Users authenticate via Internet Identity, complete a required display-name profile, then create a challenge (set a start date) or join an existing one via single‑use invitation codes embedded in shareable links. Participants can view the roster and profiles, upload one audio reflection per day/assignment (and delete to re-upload), browse/listen to other participants’ recordings, and use an in-challenge chat with polling, reply references, and author-only message editing. The frontend uses TanStack React Query for all canister calls with consistent query keys/invalidation, and includes robust state recovery when a challenge is deleted or missing (cache reset, URL/session cleanup, and a user-facing ‘Challenge Deleted’ notice).",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Role-based access control (RBAC) with admin bootstrap secret",
      "synonyms": [
        "authorization mixin",
        "access-control",
        "CAFFEINE_ADMIN_TOKEN bootstrap"
      ],
      "description": "Backend maintains per-principal roles (admin/user/guest). An initialization call compares a caller-provided secret to the CAFFEINE_ADMIN_TOKEN environment variable to bootstrap the first admin; exposes role lookup, admin checks, and admin-only role assignment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Internet Identity authentication with delegation restore",
      "synonyms": [
        "AuthClient integration",
        "InternetIdentityProvider",
        "login/logout"
      ],
      "description": "Frontend wraps @dfinity/auth-client in a React context to initialize and restore delegations, provide login/logout actions, expose login status flags, and surface login errors.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Identity-bound backend actor creation with access-control initialization",
      "synonyms": [
        "useActor",
        "actor factory",
        "_initializeAccessControlWithSecret"
      ],
      "description": "Frontend creates an anonymous actor when logged out and an identity-bound actor when logged in; authenticated actor creation calls the RBAC initializer with a secret read from URL hash/session, then invalidates and refetches non-actor queries.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Centralized React Query API layer with consistent query keys",
      "synonyms": [
        "useQueries",
        "QUERY_KEYS",
        "cache invalidation"
      ],
      "description": "All canister operations (profiles, challenge status/IDs, challenge lifecycle, invitation codes, participants, recordings, start time, chat) are wrapped in TanStack React Query hooks with standardized query keys and targeted invalidation on mutation success.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "User profile management with required completion gate",
      "synonyms": [
        "getCallerUserProfile",
        "saveCallerUserProfile",
        "ProfileCompletionGate"
      ],
      "description": "Authenticated users must set a non-empty display name before using the app. The frontend fetches the caller profile, blocks main UI if missing/empty, shows a form with validation, saves the profile, and unblocks once updated data is fetched.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Single active challenge tracking with creator/participant challenge ID resolution",
      "synonyms": [
        "getUserChallengeStatus",
        "getActiveChallengeIdForCreator",
        "getActiveChallengeIdForParticipant",
        "useGetUnifiedChallengeId"
      ],
      "description": "Backend tracks active challenge membership and separately indexes creator and participant challenge IDs. Frontend merges creator/participant lookups into a unified resolver used across screens.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Challenge lifecycle management (create, update start time, leave, delete)",
      "synonyms": [
        "createChallenge",
        "updateStartTime",
        "leaveChallenge",
        "deleteChallenge",
        "getChallengeStartTime"
      ],
      "description": "Creators can create a challenge and update its start time (until end of Day 1 per backend rules). Participants can leave. Creators can delete the entire challenge. Participants can query the start time for day/date formatting.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Invitation codes and shareable invitation links",
      "synonyms": [
        "generateInvitationCode",
        "getAvailableInvitationCodes",
        "redeemInvitationCode",
        "buildInvitationLink"
      ],
      "description": "Creators generate single-use invitation codes and list unused codes. Participants redeem codes to join. Frontend builds copyable invitation URLs from current location by adding challengeId/code query params without dropping other params.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Invitation deep-link persistence and automatic redemption",
      "synonyms": [
        "persistInvitationParams",
        "AutoInvitationRedeemGate",
        "auto-join"
      ],
      "description": "Invitation params parsed from the URL are persisted in sessionStorage. After authentication and profile completion, the app automatically redeems the stored invitation for users without an active challenge, shows loading/error UI, clears invitation params from storage/URL on success/dismiss, and invalidates relevant caches.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Challenge participant roster and profile listing",
      "synonyms": [
        "getChallengeParticipants",
        "getAllChallengeParticipantProfiles"
      ],
      "description": "Participants can fetch the challenge roster and associated user profiles. UI displays participant names with fallbacks and supports manual refresh.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Creator removal of participants (kick)",
      "synonyms": [
        "removeParticipant",
        "participant removal"
      ],
      "description": "Challenge creators can remove other participants (cannot remove self). Backend removes the participant from the roster, deletes their stored recordings, and clears their participant-to-challenge mapping; frontend invalidates participant-related queries after removal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Audio blob storage per participant/day/assignment with no-overwrite rule",
      "synonyms": [
        "saveRecording",
        "getRecording",
        "deleteRecording",
        "getParticipantRecording",
        "getAssignmentRecordings"
      ],
      "description": "Backend stores audio blobs keyed by participant → day → assignment and prevents overwrites (must delete first). Supports fetching the caller’s recording, another participant’s recording, and per-assignment listings across participants.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "In-challenge “My” tab: upload-only audio flow with progress, playback, and delete-to-reupload",
      "synonyms": [
        "audio upload",
        "ExternalBlob progress",
        "direct URL playback"
      ],
      "description": "Frontend validates audio formats, uploads audio as ExternalBlob with upload progress tracking, fetches per-assignment recordings, plays audio via direct blob URLs, and supports deletion to enable re-upload.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "In-challenge “Team” tab: browse and play other participants’ recordings",
      "synonyms": [
        "participant selector",
        "participant day selector"
      ],
      "description": "Participants can select another participant and day, see which assignments have recordings, and play available audio from other members.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Per-challenge chat with replies and author-only editing",
      "synonyms": [
        "postMessage",
        "getMessages",
        "getMessage",
        "editMessage",
        "replyTo"
      ],
      "description": "Backend supports posting messages (requires completed profile), listing messages, fetching a single message by ID (for reply references), and editing messages only by the author. Frontend supports composing messages and replies, inline editing of own messages, reply previews, and edited indicators.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Conditional chat polling, auto-scroll, and sender name resolution",
      "synonyms": [
        "refetchInterval polling",
        "auto-scroll",
        "senderName fallback"
      ],
      "description": "Frontend polls chat messages only when the chat tab is active, auto-scrolls to new messages, and resolves sender display names from message.senderName with fallback to participant profiles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Standardized loading/error UX with shared error sanitization",
      "synonyms": [
        "QueryStateGate",
        "sanitizeErrorMessage"
      ],
      "description": "Reusable query boundary renders loading and error states with retry. A shared sanitizer blocks a known bogus migration message and maps common backend traps (recordings, challenge not found, invitation/chat auth/edit errors) to user-friendly UI messages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Routerless, URL-synced navigation state tokens",
      "synonyms": [
        "appUrlState",
        "history.replaceState",
        "screen/tab/day tokens"
      ],
      "description": "App navigation state (screen, tab, day, participant, participantDay) is stored in URL search params without a router library, preserving other parameters (including invitation params) and enabling refresh/deep-link persistence.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Challenge context persistence and comprehensive client-side recovery/reset",
      "synonyms": [
        "challengeContext",
        "challengeRecovery",
        "resetChallengeState"
      ],
      "description": "SessionStorage utility persists the last known active challenge ID; a recovery/reset utility clears persisted context, clears URL state, and removes/invalidates all challenge-related React Query caches when a challenge is deleted or no longer exists.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Challenge deleted user-facing notice",
      "synonyms": [
        "ChallengeDeletedNotice",
        "challengeDeletedNotice flag"
      ],
      "description": "When the app detects a missing/deleted challenge, it sets a sessionStorage-backed notice flag and shows a dismissible alert dialog explaining the challenge was deleted and the user was disconnected; dismissing clears the flag and returns the user to the menu.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Unified entry/menu screen with state-based primary CTA",
      "synonyms": [
        "UnifiedEntryMenu",
        "state-based CTA"
      ],
      "description": "A unified entry screen displays a primary call-to-action based on auth + challenge state (Login vs Create challenge vs Enjoy Challenge), includes theme/auth controls and info popup triggers, and can navigate to management for authenticated users.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Manage challenge screen (start date, invites, participants, leave, delete)",
      "synonyms": [
        "Screen4Placeholder",
        "challenge management"
      ],
      "description": "Challenge management UI supports creating/updating the start date, generating/copying invitation links (creator-only), listing participants, self-leave confirmation, creator removal of participants, and creator deletion of the challenge with post-delete recovery reset.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Light/dark theme toggle with persistence",
      "synonyms": [
        "useTheme",
        "ThemeToggle",
        "dark mode"
      ],
      "description": "Users can toggle light/dark mode; selection persists in localStorage and is applied by toggling the 'dark' class on the document root. Tailwind theme tokens are defined via CSS variables.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Shared dialog/popup system and informational dialogs",
      "synonyms": [
        "SharedPopup",
        "InfoPopups",
        "shadcn Dialog wrapper"
      ],
      "description": "SharedPopup standardizes dialog sizing and scroll behavior. InfoPopups provides “About Social Contemplation” and “About the challenge” dialogs with programmatic triggers.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Developer/diagnostic auth panel (disabled by default)",
      "synonyms": [
        "DevPanel",
        "AuthButton diagnostics"
      ],
      "description": "Provides optional developer UI showing auth status/principal and manual query invalidation for debugging. Not rendered by default.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Caffeine blob-storage operational endpoints",
      "synonyms": [
        "_caffeineStorageRefillCashier",
        "_caffeineStorageUpdateGatewayPrincipals",
        "_caffeineStorageBlobsToDelete",
        "_caffeineStorageConfirmBlobDeletion"
      ],
      "description": "Backend exposes operational methods for cycles refill via a cashier canister, updating authorized gateway principals, listing dead blobs (authorized-only), confirming deletion and triggering GC, and issuing upload certificates.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Admin-only RSVP and invite-code registry subsystem",
      "synonyms": [
        "InviteLinksModule",
        "generateInviteCode",
        "submitRSVP",
        "getAllRSVPs",
        "getInviteCodes"
      ],
      "description": "Backend includes an admin subsystem for generating invite codes and collecting RSVPs; admins can list RSVPs and invite codes, while anyone can submit an RSVP tied to an invite code (with input validation).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Fixed assignment catalog and day/date formatting utilities",
      "synonyms": [
        "FIXED_ASSIGNMENTS",
        "formatDayHeader",
        "clampDay"
      ],
      "description": "Frontend defines 5 fixed daily assignments with full content and provides helpers to clamp/validate day selection and format a day header (weekday + date) from the challenge start time.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-fix-the-day-index-mismatch-end-to-end-so-the-app-can-use-day-1-7-in-the-ui-while-the-backend-can-safely-store-validate-against-its-day-0-6-model-ensure-all-recording-related-operations-save-get-delete-getparticipantrecording-getassignmentrecordings-consistently-use-the-same-normalized-day-index",
      "title": "Fix the day-index mismatch end-to-end so the app can use Day 1–7 in the UI while the backend can safely store/validate against its Day 0–6 model; ensure all recording-related operations (save/get/delete/getParticipantRecording/getAssignmentRecordings) consistently use the same normalized day index.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix backend/frontend mismatch for recording uploads: align assignment IDs (e.g., awareness/utopia/...) and day indexing (frontend 1–7 vs backend 0–6) to stop 'Invalid assignment' traps and day validation failures",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-2",
      "summary": "In-challenge chat tab for all challenge participants with periodic polling, profile-name display, inline edit of own messages, and reply references",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-3",
      "summary": "Switch audio capture UX to upload-only (no in-browser recorder): upload button with progress bar; allow formats M4A(AAC), 3GP, WAV, MP3; 1 upload per day+assignment, delete to re-upload; visible to all participants in Team tab",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-4",
      "summary": "Entry/menu screen uses one shared layout with a single primary button that changes by state: logged out (Login), logged in no challenge (Create challenge), logged in with challenge (Go to challenge); add back button near 'My Challenge' header",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-5",
      "summary": "Add light/dark mode toggle and header icons (login/logout + settings gear), applied consistently across menu states",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-6",
      "summary": "Manage Challenge screen: Save to create/confirm challenge start date; after save allow generating invite URLs (single-use) and show participants list; everyone can leave; creator can remove participants and delete challenge; deleting challenge fully disconnects all users and shows a UI notice",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-7",
      "summary": "Screen 6 (challenge view): 7-day limit; Tab 1(My) and Tab 2(Team) show fixed 5 assignments per day (Awareness, Utopia, Small steps, Support strategies, Other contemplations) with assignment-text popups; day header shows day number + weekday + calendar date; Team tab lets everyone listen to everyone’s uploads across all days/assignments",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-8",
      "summary": "Polish & consistency: URL tokens to restore exact tab/subview on refresh, single shared popup component with unified behavior everywhere, responsive checks for mobile-first plus tablet/desktop",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-9",
      "summary": "Update the backend recording validation to recognize the frontend assignment IDs (at minimum: \"awareness\" and \"utopia\", plus the other fixed assignments currently used by the frontend) so that recording save/get/delete operations no longer trap with \"Invalid assignment: awareness\".",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-11",
      "summary": "Make the backend tolerant to both legacy and current client inputs by normalizing (a) day values and (b) assignment IDs at the backend boundary before validation/storage, to reduce the risk of future mismatches causing traps.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Backend is a single Motoko actor composed via mixins (authorization/RBAC + caffeine blob-storage ops) plus an invite-links subsystem module.",
    "Frontend data access is centralized through TanStack React Query hooks with exported QUERY_KEYS for consistent caching and mutation invalidation.",
    "Identity-aware actor creation: anonymous vs identity-bound actor; actor recreation triggers broad invalidation/refetch of dependent queries.",
    "App navigation is routerless and URL-synced via search params (screen/tab/day/participant/participantDay) using history.replaceState for refresh/deep-link resilience.",
    "SessionStorage is used for persistence of invitation params, active challenge context, and the challenge-deleted notice flag across reloads/navigation.",
    "Challenge recovery is implemented as a first-class utility that clears persisted context, clears URL navigation state, and removes/invalidates challenge-scoped query caches.",
    "Audio is handled as blob uploads (ExternalBlob) with upload progress callbacks and playback via direct blob URLs (no overwrite; delete-to-reupload).",
    "Chat is stored per-challenge in canister state, with client polling enabled only when the chat tab is active and reply references resolved from cache or fetched by ID.",
    "UI is mobile-first with Tailwind CSS theme tokens + shadcn/ui primitives; dialogs are standardized via a SharedPopup wrapper.",
    "English-only runtime i18n context provides key-based string lookup from a static translations dictionary and sets document lang/dir to en/ltr."
  ],
  "known_issues": [
    "Backend day validation expects 0–6 (\"Day 0\" to \"Day 6\"), while the frontend uses 1–7; Day 7 and any 1-based mapping will trap server-side.",
    "Backend validAssignments do not match frontend assignment IDs (frontend uses \"awareness\", \"utopia\", \"small-steps\", etc.; backend expects \"warmup\", \"repOneOne\", etc.), causing recording operations to trap with \"Invalid assignment\".",
    "Chat retention is effectively unbounded: maxChatMessages is declared but not enforced, risking uncontrolled memory growth.",
    "Canister state does not appear upgrade-stable (no stable vars); upgrades may risk state loss without explicit persistence/migration handling.",
    "Authorization bootstrap traps if CAFFEINE_ADMIN_TOKEN is not set; misconfigured deployments will break authenticated flows during actor initialization.",
    "Blob-storage cashier env var is spelled CAFFFEINE_STORAGE_CASHIER_PRINCIPAL (triple “F”), increasing misconfiguration risk.",
    "Storage.refillCashier uses Nat.sub(currentBalance, reservedCycles) which can underflow/trap if cycle balance is below the reserved threshold.",
    "In Team tab URL restore, participant is stored as an untyped string cast to any before being set as a Principal, which may break Principal-typed calls after refresh/deep-link.",
    "There are several empty/placeholder frontend files (e.g., Screen1Placeholder.tsx, Screen5ManageChallenge.tsx, LanguageSwitcher.tsx, RecordingFeedback.tsx, useAudioRecording.ts) and unused/empty locale files that may confuse maintenance.",
    "Translations infrastructure is partially inconsistent: translations.ts lists many languages, but the active I18nContext is English-only and locale JSON files are empty placeholders."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "Social Contemplation",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}