{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Social Contemplation is an ICP dapp (Motoko canister backend + React/TypeScript frontend) using Internet Identity. Users can only be in 1 active challenge at a time, created by setting a start date (editable until end of Day 1) or joined via single-use invitation URLs. Challenge management (create/edit) happens in a Manage Challenge panel with start-date save action, invitation URL generation (post-save), and participant management (everyone can self-leave; creator can remove participants and delete the challenge permanently). The in-challenge experience is a fixed 7-day journey with 5 fixed assignments per day (Awareness, Utopia, Small steps, Support strategies, Other contemplations). Each day+assignment+participant supports exactly one audio recording (record/play/delete; delete is permanent and allows re-record). Team tab exposes all participants’ recordings across all days/assignments. UI is mobile-first responsive with unified popups, URL-token subview restore, global i18n with 10 common languages + Dutch and RTL support, icon-only tabs, and enhanced recording feedback (waveform/REC/timer focus component).",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Motoko canister backend for challenges, invites, profiles, and recordings",
      "synonyms": [
        "backend actor API",
        "canister service"
      ],
      "description": "Implements canister APIs for user profiles, challenge lifecycle (create/update start time/leave/delete), participant membership management, invitation code generation/redeem, challenge start time reads, and per-user/day/assignment audio recording storage and retrieval using ExternalBlob.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Role-based access control (RBAC) with admin bootstrap",
      "synonyms": [
        "authorization mixin",
        "access-control"
      ],
      "description": "Provides admin/user/guest roles. First-time initialization assigns roles by comparing a user-provided secret with the CAFFEINE_ADMIN_TOKEN env var, and exposes methods to get caller role, check admin, and assign roles (admin-only enforcement inside AccessControl).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Blob-storage operational endpoints (gateway authorization, dead blob pruning, cycle refill)",
      "synonyms": [
        "_caffeineStorage* APIs",
        "storage ops mixin"
      ],
      "description": "Exposes operational endpoints for checking blob liveness, listing/pruning dead blobs (authorized principals), updating gateway principals, and refilling a cashier canister with cycles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Internet Identity authentication provider and auth UI",
      "synonyms": [
        "AuthClient integration",
        "InternetIdentityProvider",
        "AuthButton"
      ],
      "description": "Implements an Internet Identity provider that loads stored identities on mount, supports login/logout, tracks login status/error, and a UI button that logs in/out and clears React Query cache on logout.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Identity-bound actor creation with access-control initialization",
      "synonyms": [
        "useActor",
        "actor factory"
      ],
      "description": "Creates either an anonymous or identity-bound canister actor. On authenticated actor creation, calls _initializeAccessControlWithSecret using a secret read from the URL hash, then invalidates/refetches all non-actor React Query queries when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "React Query hook layer for backend reads/writes",
      "synonyms": [
        "TanStack React Query hooks",
        "useQueries"
      ],
      "description": "Provides query and mutation hooks for user profiles, challenge state, invites, participants, start time, and recordings with enabled gating (actor/auth), retry/staleTime tuning, and targeted cache invalidation on success.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "User profile save and retrieval",
      "synonyms": [
        "saveCallerUserProfile",
        "getCallerUserProfile",
        "getUserProfile"
      ],
      "description": "Allows authenticated users to save and fetch their own profile; profile lookup for other principals is permissioned server-side and used client-side for participant display with fallback handling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Challenge status detection for routing/gating",
      "synonyms": [
        "getUserChallengeStatus",
        "hasActiveChallenge"
      ],
      "description": "Backend reports whether the caller is currently in any challenge; frontend uses this to decide which screen to show and to prevent entering in-challenge screens without a resolved challengeId.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Challenge creation and start date editing (Day-1 restriction)",
      "synonyms": [
        "createChallenge",
        "updateStartTime"
      ],
      "description": "Authenticated users can create a challenge with a start time. The creator can update the start time only before the end of Day 1; backend enforces time-window restrictions and frontend provides create vs update UX in a unified screen.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Active challenge ID resolution (creator/participant + session fallback)",
      "synonyms": [
        "getActiveChallengeIdForCreator",
        "getActiveChallengeIdForParticipant",
        "useResolvedActiveChallengeId"
      ],
      "description": "Resolves the active challengeId by prioritizing creator mapping, then participant membership, then a sessionStorage persisted id; used to recover context after refresh for non-creators.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Invitation code generation and redemption with single-use links",
      "synonyms": [
        "generateInvitationCode",
        "redeemInvitationCode",
        "available invitation codes"
      ],
      "description": "Creators generate invitation codes (stored with used/unused status). Participants redeem single-use codes to join. Backend restricts generating and redeeming to before the end of Day 1 from start time.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Invitation URLs (URL-only display + copy-to-clipboard)",
      "synonyms": [
        "buildInvitationLink",
        "copy invite link"
      ],
      "description": "Frontend constructs shareable invitation URLs (challengeId + code in query params), displays URLs (not raw codes) in the manage screen, and supports one-click copy to clipboard per URL.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Invite URL auto-join flow after authentication",
      "synonyms": [
        "auto-redeem invite",
        "persistInvitationParams"
      ],
      "description": "When an invitation URL is opened, invitation params are persisted pre-auth. After actor readiness and authentication, the app automatically redeems the invitation and transitions into the in-challenge screen; errors are shown with retry/dismiss.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Participant listing and participant profile display",
      "synonyms": [
        "getChallengeParticipants",
        "getAllChallengeParticipantProfiles"
      ],
      "description": "Participants can list principals in the challenge. Frontend can fetch and display participant names (bulk profiles via canister API, with fallback per-principal fetch and Unknown User handling).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Participant self-leave and creator moderation actions",
      "synonyms": [
        "leaveChallenge",
        "removeParticipant",
        "deleteChallenge"
      ],
      "description": "Any participant can leave a challenge (also clearing persisted challenge context). Creators can remove other participants and permanently delete the challenge; UI exposes these actions via inline participant list controls and confirmation dialogs.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Per-user/day/assignment audio recording storage (no overwrite)",
      "synonyms": [
        "saveRecording",
        "getRecording",
        "deleteRecording"
      ],
      "description": "Stores exactly one recording per user per day+assignment; backend rejects overwrite attempts. Users can fetch their own recordings and delete them (then re-record). Frontend maps recording-not-found traps to null for smoother UX.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Team playback (listen to other participants’ recordings)",
      "synonyms": [
        "getParticipantRecording",
        "getAssignmentRecordings"
      ],
      "description": "Participants can fetch another participant’s recording for a day+assignment and (optionally) fetch all participants’ recordings for a day+assignment. The Team tab UI allows selecting a participant and listening across assignments.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "In-challenge UI with URL-synced tab/day/participant state",
      "synonyms": [
        "Screen6InChallenge",
        "appUrlState"
      ],
      "description": "Implements an in-challenge screen with icon-only tabs (My/Team/Coming Soon), a 7-day selector, assignment detail popups, and URL query param persistence for tab/day/participant selections to restore view state after refresh.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Browser audio capture with live recording feedback",
      "synonyms": [
        "useAudioRecording",
        "RecordingFeedback"
      ],
      "description": "Records microphone audio via MediaRecorder and computes live audio-level feedback via Web Audio analyser; shows a prominent REC/timer/level meter while recording and cleans up tracks/audio context on stop/unmount.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Custom i18n context with language persistence and RTL layout support",
      "synonyms": [
        "I18nProvider",
        "LanguageSwitcher"
      ],
      "description": "Provides nested-key translation lookup, persists chosen language in localStorage, updates document dir/lang for RTL/LTR, and renders a dropdown language switcher with RTL-aware alignment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Standardized query loading/error UI with error sanitization",
      "synonyms": [
        "QueryStateGate",
        "sanitizeErrorMessage"
      ],
      "description": "Wraps query rendering with consistent loading and retryable error UI and sanitizes/massages common backend trap messages into user-friendly strings.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "SessionStorage utilities for challenge and invitation context persistence",
      "synonyms": [
        "challengeContext",
        "urlParams invitation persistence"
      ],
      "description": "Persists last-known active challengeId and pending invitation params in sessionStorage to recover state after refresh and to support invite auto-join flows; clears persisted state on leave/delete/dismiss.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-implement-a-working-manage-challenge-screen-flow-where-a-challenge-is-only-created-saved-via-an-explicit-save-action-under-the-start-date-section-and-invitations-are-only-available-after-a-successful-save",
      "title": "Implement a working Manage Challenge screen flow where a challenge is only created/saved via an explicit **Save** action under the start-date section, and invitations are only available after a successful save.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-fix-incorrect-managed-challenge-state-when-a-stale-persisted-challengeid-exists-but-no-real-challenge-exists-in-the-backend-so-the-ui-does-not-get-stuck-showing-participants-with-no-way-to-create-save",
      "title": "Fix incorrect 'managed challenge' state when a stale/persisted challengeId exists but no real challenge exists in the backend, so the UI does not get stuck showing Participants with no way to create/save.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-there-is-a-clear-working-create-challenge-entry-point-that-opens-manage-challenge-in-create-mode-no-challenge-created-until-save",
      "title": "Ensure there is a clear, working 'Create challenge' entry point that opens Manage Challenge in create mode (no challenge created until Save).",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Manage Challenge create/edit flow: start-date input with explicit Save that creates/saves challenge; invitation URLs available only after save; participant list with self-leave and creator remove/delete-challenge actions",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-2",
      "summary": "Invitation system uses shareable URL links (not raw codes): single-use, auto-join to correct challenge after login, removed once redeemed",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-3",
      "summary": "Screen 6 core structure: 7-day hard limit, three tabs as icon-only (My=single person, Team=multiple people, Coming Soon=chat) with consistent day selector UI",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-4",
      "summary": "Fixed 5 assignments per day with assignment-text popup + record/play/delete per assignment; persist and share recordings across participants in Team tab",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-5",
      "summary": "Recording UX: large in-recording focus component with live waveform/level meter, REC status and timer, plus reassuring feedback",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-6",
      "summary": "Polish & consistency: URL tokens restore exact tab/subview on refresh; single shared popup component with identical behavior everywhere; responsive checks mobile-first + tablet + desktop",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-7",
      "summary": "i18n expansion: standard top-10 most common languages + Dutch, seeded with high-quality machine translations; RTL layout support for applicable languages",
      "reqIds": [],
      "status": "in_progress"
    }
  ],
  "architectural_notes": [
    "Backend is a single Motoko actor (backend/main.mo) composed using mixins for authorization and blob-storage operational endpoints.",
    "Authorization is simple RBAC (admin/user/guest) with a bootstrap initializer that compares a user-provided secret against an env var token.",
    "Challenge, profile, invite-code, and recording data are stored in in-memory Map/Set structures and updated via clone-and-replace patterns.",
    "Frontend data access is centralized in TanStack React Query hooks with explicit query keys, enabled-gating on actor/auth readiness, and targeted invalidation after mutations.",
    "Actor creation is identity-bound (Internet Identity) and triggers global query invalidation/refetch when the actor identity changes.",
    "Navigation is state-based (no router): the app chooses screens based on auth + user challenge status, and persists screen/tab/day/participant selections via URL search params.",
    "Challenge context recovery is multi-source: creator active challengeId → participant active challengeId → sessionStorage fallback.",
    "Audio capture uses MediaRecorder plus Web Audio API (AnalyserNode) to compute a live audio level meter and elapsed time feedback.",
    "UI is built with Tailwind CSS + shadcn/ui primitives; layout uses a centered “card shell” and RTL-aware alignment.",
    "Dialogs are standardized via a SharedPopup wrapper (shadcn Dialog + ScrollArea) for consistent sizing/scroll behavior and RTL direction."
  ],
  "known_issues": [
    "Canister state (profiles/challenges/invites/recordings/access-control) is not stored in stable variables; upgrades/reinstalls will lose data.",
    "_initializeAccessControlWithSecret traps if CAFFEINE_ADMIN_TOKEN is not set, potentially breaking authenticated actor initialization in misconfigured deployments.",
    "Blob-storage cashier env var is spelled CAFFFEINE_STORAGE_CASHIER_PRINCIPAL (triple “F”), which is error-prone to configure.",
    "_caffeineStorageUpdateGatewayPrincipals has no caller authorization check, allowing any caller to refresh the gateway principal list.",
    "Invitation codes are generated client-side using Math.random() (not cryptographically secure).",
    "Challenge start time is constructed from a local date at 00:00, which can vary by user timezone and shift day boundaries across locales.",
    "Day header formatting hard-codes 'en-US' rather than using the selected app language.",
    "Duplicate hook name useUserChallengeStatus exists in both hooks/useQueries.ts and hooks/useUserChallengeStatus.ts, increasing risk of inconsistent imports.",
    "i18n supports selecting many languages, but translations.ts only defines English; other selections mostly fall back to returning translation keys.",
    "Screen6 URL restore sets selectedParticipant as a raw string cast to Principal (\"as any\"), which can break backend calls after refresh until the user re-selects a participant."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "Social Contemplation",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}