{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-05T23:03:22.839Z",
  "summary": "Diff adds an assignment ID compatibility utility, normalizes React Query cache keys by assignment ID, and introduces a retry helper with console diagnostics. However, the diff excerpt is truncated before showing that all required recording operations are wrapped to perform the one-time retry on \"Invalid assignment:\" errors, and it does not clearly show the single user-facing error behavior when both attempts fail.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "When the backend returns an error containing \"Invalid assignment:\" for any recording operation (save, share, get, delete, getAssignmentRecordings, getParticipantRecording), the frontend retries the same request once using the alternate ID format, proceeds normally if retry succeeds, and shows a single English user-facing error if both attempts fail (no duplicate toasts/errors).",
      "reason": "While a retry helper is introduced, the diff is truncated before showing the actual execution wrapper and its use across all listed recording operations, and no concrete UI error/toast de-duplication behavior is visible in the provided changes.",
      "evidence": [
        "frontend/src/hooks/useQueries.ts (truncated; shows retry helper but not the full integration across operations)",
        "frontend/src/utils/assignmentIdCompat.ts"
      ]
    },
    {
      "id": "REQ-3",
      "requirement": "When an invalid-assignment error occurs, console logs indicate the original assignment ID, the fallback ID used for retry, and whether the retry succeeded, including a sanitized backend error message, without sensitive user data.",
      "reason": "The shown logs include original/alternate IDs and success/failure, and sanitizeErrorMessage is logged on retry failure, but the excerpt does not show logging of the sanitized *original* backend error message at the moment the retry path is triggered (could be in truncated portion).",
      "evidence": [
        "frontend/src/hooks/useQueries.ts (truncated; logging shown for retry attempt/success and retry failure with sanitizeErrorMessage, but original error logging not shown)"
      ]
    }
  ],
  "hallucinated_features": [],
  "confidence": 0.56,
  "changed_files": [
    "frontend-file-summaries.txt",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/utils/assignmentIdCompat.ts",
    "frontend/src/utils/recordingIds.ts",
    "project_state.json"
  ]
}